bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
/********************************************************
*                                                       *
*                Delphi Runtime Library                 *
*                                                       *
* Copyright(c) 2016 Embarcadero Technologies, Inc.      *
*               All rights reserved                     *
*                                                       *
*   Copyright and license exceptions noted in source    *
*                                                       *
********************************************************/

// common compact dataformat, used to transmit data between multiple tiers.

#ifdef _UNIX
#include <stdlib.h>
#include <dlfcn.h>
#define DSPICKLE_C
#if !defined(__ANDROID__)
#include <nl_types.h>
#endif
#else
#include <stdio.h>
#include <windows.h>
#endif
#include <string.h>
#pragma hdrstop

#include "alctypes.h"
#include "ossrv.h"

#include "dspickle.h"
#include "dsxml.h"
#include "dsconst.h"
#ifndef _UNIX
#include <mbstring.h> //This is for _ismbblead
#else
int _ismbblead(int c)
{
   UNREFERENCED_PARAMETER(c);
   return FALSE;
}
#endif


extern INT32 iObjCount; // Defined in alchemy.cpp

#define  szFIELDPROPS "FIELDPROPS"
#define  DSMAXPCKLALLOCSIZE          1000 * 1024 // Maximum pickle block size.
BOOL bNoOfBufAllocs = TRUE;

BOOL bAsAttrs = 1; // XML

DBIResult DBIFN GetFldObj(UINT32 iFieldType, BOOL bConvert, class DSXML_W *pDsXml, FLDConv **ppFldObj);

#define ConvertInt8(iIn)    ((BYTE) iIn);
#define ConvertInt16(iIn)   ((bBigEndian)?   ConvINT16(iIn) :iIn);
#define ConvertUInt16(iIn)  ((bBigEndian)?  ConvUINT16(iIn) :iIn);
#define ConvertInt32(iIn)   ((bBigEndian)?   ConvINT32(iIn) :iIn);
#define ConvertUInt32(iIn)  ((bBigEndian)?  ConvUINT32(iIn) :iIn);
#define IncUInt16(iIn)      ((bBigEndian) ? IncUINT16(iIn) : (iIn+1));
#define IncUInt32(iIn)      ((bBigEndian) ? IncUINT32(iIn) : (iIn+1));

pBYTE XMLWrite(pBYTE pPos, pCHAR pName, BOOL bBegin);
pBYTE XMLReadName(pBYTE pPos, pCHAR pName, BOOL bBegin);
DBIResult DBIFN XmlMakeType(UINT32 iFieldType, pCCHAR *ppzXmlType, pUINT32 pFixedSize);

INT16 ConvINT16(INT16 iIn)
{
   INT16 iOut;
   BYTE bl;

   iOut = (INT16)(iIn >> 8); // Store high byte in low byte
   bl = (BYTE)iIn;
   ((pBYTE)iOut)[1] = bl;
   return iOut;
}

UINT16 ConvUINT16(UINT16 iIn)
{
   UINT16 iOut;
   BYTE bl;

   iOut = (UINT16)(iIn >> 8); // Store high byte in low byte
   bl = (BYTE)iIn;
   ((pBYTE)iOut)[1] = bl;
   return iOut;
}

INT32 ConvINT32(INT32 iIn)
{
   BYTE iOut[4];
   pBYTE pIn = (pBYTE) &iIn;

   iOut[0] = pIn[3];
   iOut[1] = pIn[2];
   iOut[2] = pIn[1];
   iOut[3] = pIn[0];

   return *(pINT32) &iOut;
}

UINT32 ConvUINT32(UINT32 iIn)
{
   BYTE iOut[4];
   pBYTE pIn = (pBYTE) &iIn;

   iOut[0] = pIn[3];
   iOut[1] = pIn[2];
   iOut[2] = pIn[1];
   iOut[3] = pIn[0];

   return *(pINT32) &iOut;
}

// In place conversion of datapacket header
VOID ConvertHeader(BOOL bBigEndian, pVOID pDataPacketBuf)
{
   if (bBigEndian)
   {
      pDSPCKLHdrInfo pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;

      pHdrInfo->iMagicNo = ConvertUInt32(pHdrInfo->iMagicNo);
      pHdrInfo->iMajorVer = ConvertUInt16(pHdrInfo->iMajorVer);
      pHdrInfo->iMinorVer = ConvertUInt16(pHdrInfo->iMinorVer);
      pHdrInfo->iHeaderSize = ConvertUInt32(pHdrInfo->iHeaderSize);
      pHdrInfo->iColumnCount = ConvertUInt16(pHdrInfo->iColumnCount);
      pHdrInfo->iRowCount = ConvertUInt32(pHdrInfo->iRowCount);
      pHdrInfo->iProperties = (PCKLProps)ConvertUInt32(pHdrInfo->iProperties);
      pHdrInfo->iReserved = ConvertUInt16(pHdrInfo->iReserved);
   }
}

UINT16 IncUINT16(UINT16 iIn)
{
   UINT16 iOut = (UINT16)(ConvUINT16(iIn) + 1);
   return ConvUINT16(iOut);
}

UINT32 IncUINT32(UINT32 iIn)
{
   UINT32 iOut = ConvUINT32(iIn) + 1;
   return ConvUINT32(iOut);
}

// Returns number of FieldIDs required to represent all fields in pFldDes
// Only Array fields will cause this number to grow beyond iFlds.
// Assuming iUnits1 is set to number of fields in ADT's and ARRAYs, computes
// iUnits2 as total number of fields within that structure!
UINT32 ComputeMaxFieldIDs(UINT32 iFlds, pDSDATAPACKETFLDDescX pFldDes, pINT16 *ppiUnits2Array)
{
   INT32 i;
   UINT32 iMaxFldId = 0;
   pINT16 piUnits2Array;
   UINT32 iTotalElements = 0;
   UINT32 iFieldType, iSuccFieldType, iFieldLength;

   piUnits2Array = *ppiUnits2Array;
   for (i = iFlds-1; i >= 0; i--)
   {
      *(piUnits2Array + i) = 1;
      iFieldType = pFldDes[i].iFieldType & dsTypeBitsMask;
      iFieldType = iFieldType >> dsSizeBitsLen;

      if (iFieldType == dsfldARRAY)
      {
         UINT32 iElementSize;
         iSuccFieldType = pFldDes[i+1].iFieldType & dsTypeBitsMask;
         iSuccFieldType = iSuccFieldType >> dsSizeBitsLen;
         if (iSuccFieldType == dsfldARRAY || iSuccFieldType == dsfldADT)
         {
            // Computed value (+1 to include the pseudofield)
            iElementSize = piUnits2Array[i+1] + 1;
         }
         else
            iElementSize = 1;
         iFieldLength = pFldDes[i].iFieldType & dsSizeBitsMask;
         piUnits2Array[i] = (UINT16)(iFieldLength * iElementSize);
         // (-1 because first element has already been counted)
         iMaxFldId += piUnits2Array[i] - iElementSize;
      }
      else
      {
         if ((iFieldType == dsfldADT) || (iFieldType == dsfldEMBEDDEDTBL))
         {
            UINT32 j, jFix, iEl;

            iTotalElements = 0;
            // Go forward to compute totalelement count
            iFieldLength = pFldDes[i].iFieldType & dsSizeBitsMask;
            if (iFieldType == dsfldEMBEDDEDTBL)
               iTotalElements = iFieldLength;
            else
            {
               j = i + 1;
               jFix = j;
               for (; j < i + 1 + iFieldLength; j++, jFix++)
               {
                  iFieldType = pFldDes[jFix].iFieldType & dsTypeBitsMask;
                  iFieldType = iFieldType >> dsSizeBitsLen;
                  if (iFieldType == dsfldADT)
                  {
                     iEl = pFldDes[jFix].iFieldType & dsSizeBitsMask;
                     iTotalElements += piUnits2Array[jFix];
                     jFix += iEl;
                  }
                  else if (iFieldType == dsfldARRAY)
                  {
                     iEl = piUnits2Array[jFix] / (pFldDes[jFix].iFieldType & dsSizeBitsMask);
                     iTotalElements += piUnits2Array[jFix];
                     jFix += iEl;
                  }
                  iTotalElements++; // Field itself
               }
            }
            piUnits2Array[i] = (UINT16)iTotalElements;
         }
      }
      iMaxFldId++;
   }
   return iMaxFldId;
}

// Create an array of field-descriptors given the user defined ones.
// In case of array datatypes, the array is 'expanded'
DBIResult MakeAdtFldDescs(UINT32 iFlds, pDSDATAPACKETFLDDescX pFldDes, pUINT32 piFlds, pDSPROVADTFLDDesc *ppFldDes)
{
   INT32 iMaxFieldIDs;
   pINT16 piUnits2Array = NULL;
   pDSPROVADTFLDDesc pAdtFieldDesc = NULL;
   DBIResult rslt = DBIERR_NONE;
   INT32 iFieldType, iFieldLength;
   INT32 i, j;

   piUnits2Array = new INT16[iFlds];
   iMaxFieldIDs = ComputeMaxFieldIDs(iFlds, pFldDes, &piUnits2Array);

