bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
   *ppFldDes = NULL;
   pAdtFieldDesc = (pDSPROVADTFLDDesc)DsMalloc(sizeof(DSPROVADTFLDDesc) * iMaxFieldIDs);
   ZeroMem(pAdtFieldDesc, iMaxFieldIDs*sizeof(DSPROVADTFLDDesc));

   if (pAdtFieldDesc == NULL)
   {
      rslt = SetError(DBIERR_NOMEMORY);
      goto Exit;
   }

   if (iFlds == (UINT32)iMaxFieldIDs)
   {
      for (i = 0; i < iMaxFieldIDs; i++)
      {
         pAdtFieldDesc[i].iFieldID = (UINT16)(i + 1);
         pAdtFieldDesc[i].iFieldIDParent = (UINT16)(i + 1);
         pAdtFieldDesc[i].iBaseFieldType = pFldDes[i].iFieldType; // (UINT16) (iFieldType);
      }
   }
   else
   { // We need to construct fielddesc's for array-elements
      INT32 jFix, iEl;

      for (i = iFlds-1, j = iMaxFieldIDs-1; (i >= 0) && (j >= 0); i--, j--)
      {
         UINT32 iBaseFieldType = pFldDes[i].iFieldType;
         iFieldType = iBaseFieldType & dsTypeBitsMask;
         iFieldType = iFieldType >> dsSizeBitsLen;

         if (iFieldType == dsfldEMBEDDEDTBL)
         {
            jFix = j;
            if (rslt)
               goto Exit;
         }
         else if (iFieldType == dsfldARRAY)
         {
            INT32 iElSize;
            j++;
            jFix = i + 1;

            // Copy elements 'arraysize times' -1
            iFieldLength = pFldDes[i].iFieldType & dsSizeBitsMask;
            iElSize = piUnits2Array[i] / iFieldLength;
            for (iEl = 0; iEl < iFieldLength - 1; iEl++)
            {
               INT32 k, iCount;
               j -= iElSize;
               for (k = j, iCount = 0; iCount < iElSize; iCount++, k++)
               {
                  pAdtFieldDesc[k].iFieldID = (UINT16)(k + 1);
                  pAdtFieldDesc[k].iFieldIDParent = (UINT16)(jFix + iCount + 1);
                  pAdtFieldDesc[k].iBaseFieldType = pAdtFieldDesc[k+iElSize].iBaseFieldType;
               }
            }
            j--;
         }
         pAdtFieldDesc[j].iFieldID = (UINT16)(j + 1);
         pAdtFieldDesc[j].iFieldIDParent = (UINT16)(i + 1);
         pAdtFieldDesc[j].iBaseFieldType = iBaseFieldType;
      }
   }

Exit:
   if (rslt)
   {
      if (pAdtFieldDesc)
         DsFree(pAdtFieldDesc);
   }
   else
   {
      *piFlds = iMaxFieldIDs;
      *ppFldDes = pAdtFieldDesc;
   }
   if (piUnits2Array)
      delete[] piUnits2Array;
   return rslt;
}

DBIResult ExpandAllFieldDescs(UINT32 iRecStatesCnt, pDSRECState *paRecStates, // Array of record states
   BOOL bConvert, class DSXML_W *pDsXml)
{
   DBIResult rslt = DBIERR_NONE;
   pDSRECState pRecState;
   UINT32 i, k;
   pDSDATAPACKETFLDDescX pFldEntry;

   for (i = 0; i < iRecStatesCnt; i++)
   {
      pRecState = paRecStates[i];
      if (pRecState == NULL)
         continue;
      rslt = MakeAdtFldDescs(pRecState->iColumns, pRecState->pFlds_List->GetFldDesc(1), &pRecState->iAdtColumns,
         &pRecState->pAdtFieldDesc);
      if (rslt)
         goto Exit;

      // Alocate fieldobjects area
      for (k = 0; k < pRecState->iAdtColumns; k++)
      {
         pDSPROVADTFLDDesc pAdtFldDes = &pRecState->pAdtFieldDesc[k];
         UINT32 iBaseFldType = pAdtFldDes->iBaseFieldType;
         UINT32 iFieldType;
         UINT32 iBaseFldTypex;

         if (iBaseFldType == 0)
         {
            iBaseFldType = pRecState->pAdtFieldDesc[pAdtFldDes->iFieldIDParent-1].iBaseFieldType;
         }

         iFieldType = iBaseFldType & dsTypeBitsMask;
         iFieldType = iFieldType >> dsSizeBitsLen;

         pAdtFldDes->iNULLOffs = pDsXml ? (UINT16)1 : (UINT16)(((k+1 + 3) / 4)); // +1 is for attribute field!
         pAdtFldDes->iMask1 = (BYTE)(1 << ((((k+1 - 1) % 4) * 2)));
         pAdtFldDes->iMask2 = (BYTE)(1 << ((((k+1 - 1) % 4) * 2) +1));
         pFldEntry = pRecState->pFlds_List->GetFldDesc(pAdtFldDes->iFieldIDParent);

         if (pDsXml && (iFieldType == dsfldBYTES) && (strcmp(pFldEntry->szSubType, szstMEMO) == 0))
         {
            iBaseFldTypex = iBaseFldType;
            iBaseFldTypex &= (UINT32)(~dsTypeBitsMask);
            iBaseFldTypex |= (UINT32)(dsfldZSTRING << dsSizeBitsLen);
            rslt = GetFldObj(iBaseFldTypex, bConvert, pDsXml, &pAdtFldDes->pFldObj); // Special memo-case
         }
         else if (pDsXml && (iFieldType == dsfldBYTES) && (strcmp(pFldEntry->szSubType, szstWideMEMO) == 0))
         {
            iBaseFldTypex = iBaseFldType;
            iBaseFldTypex &= (UINT32)(~dsTypeBitsMask);
            iBaseFldTypex |= (UINT32)(dsfldUNICODE << dsSizeBitsLen);
            rslt = GetFldObj(iBaseFldTypex, bConvert, pDsXml, &pAdtFldDes->pFldObj); // Special memo-case
         }
         else
            rslt = GetFldObj(iBaseFldType, bConvert, pDsXml, &pAdtFldDes->pFldObj);
         if (rslt)
            goto Exit;

         pAdtFldDes->pFldObj->pNamePtr = pFldEntry->szFieldName;
         if (!pRecState->bForceTagName && (iFieldType < dsfldADT || iFieldType > dsfldREF))
            pAdtFldDes->bAsAttr = ((pFldEntry->iAttributes & fldAttrATTRNAME)!=0);
         else
            pRecState->bForceTagName = TRUE;

         if (iFieldType == dsfldEMBEDDEDTBL)
         {
            UINT32 j;
            for (j = 0; j < iRecStatesCnt; j++)
            {
               if (paRecStates[j] && paRecStates[j]->iPrevRecState == i && paRecStates[j]
                  ->iParentFieldNo == pRecState->pAdtFieldDesc[k].iFieldIDParent)
               { // Found it
                  pRecState->pAdtFieldDesc[k].iNewRecState = (UINT16)j;
               }
            }
         }
      }
   }

Exit:
   return rslt;
}

DBIResult DBIFN GetFldObj(UINT32 iFieldType, BOOL bConvert, class DSXML_W *pDsXml, FLDConv **ppFldObj)
{
   DBIResult rslt = DBIERR_NONE;
   UINT32 iPCKLFldType, iSize;
   BOOL bVarying = FALSE;
   BOOL bRepeat = FALSE;
   BOOL bSigned = FALSE;

   iSize = iFieldType & dsSizeBitsMask;
   iPCKLFldType = iFieldType & dsTypeBitsMask;
   iPCKLFldType = iPCKLFldType >> dsSizeBitsLen;
   if (iFieldType & dsVaryingFldType)
      bVarying = TRUE;
   if (iFieldType & dsArrayFldType)
   {
      if (bVarying == TRUE)
      {
         rslt = SetError(DBIERR_INVALIDFLDTYPE);
         goto Exit;
      }
      bRepeat = TRUE;
   }

