bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
   switch(iPCKLFldType)
   {
   case dsfldBOOL:
      if (!pDsXml)
         goto FIELDINT;
      *ppFldObj = (FLDConv*)new FLDCBool(bConvert, iSize);
      break;

   case dsfldDATE:
      if (!pDsXml)
         goto FIELDINT;
      *ppFldObj = (FLDConv*)new FLDCDATE(bConvert);
      break;

   case dsfldTIME:
      if (!pDsXml)
         goto FIELDINT;
      *ppFldObj = (FLDConv*)new FLDCTIME(bConvert);
      break;

   FIELDINT:
   case dsfldINT:
      bSigned = TRUE;
   case dsfldUINT:
      *ppFldObj = (iSize == 4) ? (FLDConv*)new FLDCInt32(bConvert, bSigned) : (iSize == 2) ? (FLDConv*)new FLDCInt16
         (bConvert, bSigned) : (iSize == 1) ? (FLDConv*)new FLDCInt8(bConvert, bSigned) : (iSize == 8) ? (FLDConv*)new FLDCInt64
         (bConvert, bSigned) : NULL;
      break;

   case dsfldDATETIME: // SQLTIMESTAMP
      if (iSize != sizeof(SQLTIMESTAMP))
      {
         rslt = SetError(DBIERR_INVALIDFLDTYPE);
         goto Exit;
      }
      *ppFldObj = (FLDConv*)new FLDCSQLTIMESTAMP(bConvert);
      break;

   case dsfldDATETIMEOFFSET: // SQLTIMESTAMPOFFSET
      if (iSize != sizeof(SQLTIMESTAMPOFFSET))
      {
         rslt = SetError(DBIERR_INVALIDFLDTYPE);
         goto Exit;
      }
      *ppFldObj = (FLDConv*)new FLDCSQLTIMESTAMPOFFSET(bConvert);
      break;

   case dsfldTIMESTAMP: // FLOAT
      if (iSize != 8)
      {
         rslt = SetError(DBIERR_INVALIDFLDTYPE);
         goto Exit;
      }
      if (!pDsXml)
         goto FIELDFLOAT;
      *ppFldObj = (FLDConv*)new FLDCTIMESTAMP(bConvert);
      break;

   FIELDFLOAT:
   case dsfldFLOATIEEE:
      *ppFldObj = (iSize == 8) ? (FLDConv*)new FLDCFloat(bConvert) : (iSize == 10) ? (FLDConv*)new FLDCFloatIEEE
         (bConvert) : NULL;
      break;

   case dsfldSINGLE:
      *ppFldObj = (iSize == 4) ? (FLDConv*)new FLDCSingle(bConvert) : NULL;
      break;

   case dsfldFMTBCD:
   case dsfldBCD:
      *ppFldObj = (FLDConv*)new FLDCBcd(bConvert, 32, 16); // Hardcoded!
      break;

   case dsfldARRAY:
   case dsfldADT:
      *ppFldObj = (FLDConv*)new FLDCFixed(bConvert, 0);
      break;

   case dsfldEMBEDDEDTBL:
      if (pDsXml)
         *ppFldObj = (FLDConv*)new FLDNested(bConvert);
      else
         *ppFldObj = (FLDConv*)new FLDCInt32(bConvert, FALSE);
      break;

   case dsfldBYTES:
      if (pDsXml)
      {
         if (bVarying)
         {
            *ppFldObj = (FLDConv*)new FLDBinary(iSize);
         }
         // Treat BYTES the same way as VARBYTES
         // No need for the if here anyway i'll leave it
         // incase we have to special case BYTES from VARBYTES.
         else
         {
            *ppFldObj = (FLDConv*)new FLDBinary(iSize);
         }
         break;
      }

   case dsfldUNICODE:
      if (pDsXml)
      {
         *ppFldObj = (FLDConv*)new FLDUnicode(iSize);
         break;
      }
   case dsfldZSTRING:
   case dsfldBIGDECIMAL:
   case dsfldUNKNOWN:

   default:
      if (bVarying)
      {
         *ppFldObj = (iSize == 4) ? (FLDConv*)new FLDCVar32(bConvert) : (iSize == 2) ? (FLDConv*)new FLDCVar16
            (bConvert) : (iSize == 1) ? (FLDConv*)new FLDCVar8(bConvert) : NULL;
      }
      else
         *ppFldObj = (FLDConv*)new FLDCFixed(bConvert, iSize);
      break;
   }

   if (*ppFldObj == NULL)
      rslt = SetError(DBIERR_INVALIDFLDTYPE);
   else
   {
      (*ppFldObj)->pDsXml = pDsXml;
      if (bRepeat)
      {
         *ppFldObj = new FLDCRepeat(bConvert, *ppFldObj);
         (*ppFldObj)->pDsXml = pDsXml;
      }
   }
Exit:
   return rslt;
}

DSDATAPACKET::DSDATAPACKET()
{
   InitObj();
   pDsXml = NULL;
   iRefCount = 0;
   iObjCount++;
}

DSDATAPACKET::~DSDATAPACKET()
{
   if (pFldAttrObj)
      delete pFldAttrObj;
   DelRecStates();
   if (pFlds_List)
      delete pFlds_List;
   pFlds_List = NULL;
   iObjCount--;
   if (pDsXml)
      delete pDsXml;
}

// Initializes all values
VOID DSDATAPACKET::InitObj()
{
   iAttrCnt = 0;
   iRows = 0;
   iColumns = 0;
   pFlds_List = NULL;
   pDataPacketBuf = NULL;
   iTotalSize = 0;
   bDontStreamColDescs = FALSE;
   iCurRecState = 0;
   iRecStatesCnt = 0;
   memset(paRecStates, 0, sizeof(paRecStates));
   memset((pBYTE) &dsPcklInfo, 0, sizeof(DSPCKLInfo));
   pSa = NULL;
   bMetaDataDone = FALSE;
   bBigEndian = FALSE;
   pFldAttrObj = NULL;
   bFirstRow = TRUE; // First row event
   bOptParamsDone = FALSE;
   bUTF8METADATA = FALSE;
   iANSICodePage = 0;
}

UINT32 DBIFN DSDATAPACKET::GetXMLMode(VOID)
{
   if (pDsXml)
      return pDsXml->iStyle;
   return 0;
}

DBIResult DBIFN DSDATAPACKET::SetXMLMode(INT iMode)
{
   if (iMode && pDsXml == NULL)
   {
      pDsXml = new DSXML_W();
      pDsXml->Init(0, FALSE, iMode, FALSE, bUTF8METADATA, iANSICodePage); // Compact
   }
   if (pDsXml)
   {
      pDsXml->iStyle = iMode;
      if (iMode & xmlXMLUTF8)
      {
         pDsXml->bUTF8 = TRUE;
         if (pDsXml->pXmlParse)
            pDsXml->pXmlParse->bUTF8 = TRUE;
      }
   }
   return DBIERR_NONE;
}

DBIResult DBIFN DSDATAPACKET::SetMETADATAMode(BOOL bMETADATAMode)
{
   bUTF8METADATA = bMETADATAMode;
   if (pDsXml)
      pDsXml->bUTF8METADATA = bMETADATAMode;
   return DBIERR_NONE;
}

DBIResult DBIFN DSDATAPACKET::SetANSICodePage(INT32 iCodePage)
{
   iANSICodePage = iCodePage;
   if (pDsXml)
      pDsXml->iANSICodePage = iANSICodePage;
   return DBIERR_NONE;
}

DBIResult DBIFN DSDATAPACKET::Init_Sequential(UINT32 iVersion, UINT16 iColumns)
{
   DBIResult rslt = DBIERR_NONE;
   pBYTE pPtr;
   pDSPCKLHdrInfo pHdrInfo;

   InitObj();

   if (iVersion > MAX_PICKLEVERSION)
   {
      rslt = SetError(DBIERR_DATAPACKETMISMATCH);
      goto Exit;
   }

   pDataPacketBuf = (pBYTE)SAInit(DSPCKLINITSIZE, &pSa);
   if (pDataPacketBuf == NULL)
   {
      rslt = SetError(DBIERR_NOMEMORY);
      goto Exit;
   }
   iTotalSize = DSPCKLINITSIZE;

   // Initialize the header info.
   memset((pBYTE)pDataPacketBuf, 0, sizeof(DSPCKLHdrInfo));
   pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
   pHdrInfo->iMagicNo = MAGICCOOKIE;
   pHdrInfo->iMajorVer = (UINT16)PICKLEVERSION_1; // Upgraded if any new types used
   pHdrInfo->iMinorVer = MIN_PICKLEVERSION;
   pHdrInfo->iHeaderSize = sizeof(DSPCKLHdrInfo);
   pHdrInfo->iColumnCount = iColumns;
   pHdrInfo->iRowCount = 0;

   pFlds_List = new Flds_List(iColumns);
   NewRecState(iColumns, 0, 0, &iCurRecState, szROW);

   // Specific for this function
   // Copy the field descriptor information.
   if (pDsXml && pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED))
   {
      pPtr = pDataPacketBuf + pDsXml->HeadLen();
   }
   else
      pPtr = pDataPacketBuf+sizeof(DSPCKLHdrInfo);
   dsPcklInfo.pFldDescCurrLoc = pPtr;

   pHdrInfo->iProperties = (PCKLProps)pcklpropsMETADATA_INCL;

   if (pDsXml && !pFldAttrObj)
   { // Create field object for attibute field
      pFldAttrObj = new FLDCInt8(bBigEndian, FALSE);
      pFldAttrObj->pNamePtr = szAttrFld;
      pFldAttrObj->pDsXml = pDsXml;
      dsPcklInfo.pDataCurrLoc = pPtr;
   }
Exit:
   return rslt;
}

// Creates pickle with no meta data information.
DBIResult DBIFN DSDATAPACKET::Init(UINT32 iVersion, UINT16 iColumns, pDSDATAPACKETFLDDesc pPcklFldDescs)
{
   DBIResult rslt = DBIERR_NONE;
   UINT32 i; // iRequiredSize;
   pDSPCKLHdrInfo pHdrInfo;

   if (pPcklFldDescs == NULL)
      goto Alloc; // Only initialize new datapacket

   InitObj();

   if (iVersion > MAX_PICKLEVERSION)
   {
      rslt = SetError(DBIERR_DATAPACKETMISMATCH);
      goto Exit;
   }

Alloc:

   pDataPacketBuf = (pBYTE)SAInit(DSPCKLINITSIZE, &pSa);
   if (pDataPacketBuf == NULL)
   {
      rslt = SetError(DBIERR_NOMEMORY);
      goto Exit;
   }
   iTotalSize = DSPCKLINITSIZE;

   // Initialize the header info.
   memset((pBYTE)pDataPacketBuf, 0, sizeof(DSPCKLHdrInfo));
   pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
   pHdrInfo->iMagicNo = MAGICCOOKIE;
   pHdrInfo->iMajorVer = (UINT16)PICKLEVERSION_1; // Upgraded if any new types used
   pHdrInfo->iMinorVer = MIN_PICKLEVERSION;
   pHdrInfo->iHeaderSize = sizeof(DSPCKLHdrInfo);
   pHdrInfo->iColumnCount = iColumns;
   pHdrInfo->iRowCount = 0;

   if (pPcklFldDescs == NULL)
      goto Finish; // Only initialize new datapacket

   pFlds_List = new Flds_List(iColumns);
   NewRecState(iColumns, 0, 0, &iCurRecState, szROW);

   // Specific for this function
   // Copy the field descriptor information.
   // memmove ((pBYTE) this->pFieldDesc, (pBYTE) pPcklFldDescs,
   // sizeof (DSDATAPACKETFLDDesc) * iColumns);

Finish:

   pHdrInfo->iProperties = (PCKLProps)0;
   bNoOfBufAllocs = TRUE;

   if (pDsXml && pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED))
   {
      dsPcklInfo.pDataCurrLoc = pDataPacketBuf + pDsXml->HeadLen();
   }
   else
   {
      dsPcklInfo.pDataCurrLoc = pDataPacketBuf+sizeof(DSPCKLHdrInfo);
   }
   bDontStreamColDescs = TRUE;

   if (pPcklFldDescs == NULL)
      goto Exit; // Only initialize new datapacket

   // Build the internal structures nescessary!
   for (i = 0; i < (UINT32)iColumns; i++)
   {
      rslt = AddColumnDesc(&pPcklFldDescs[i]);
      if (rslt)
         goto Exit;
   }

   if (pDsXml && !pFldAttrObj)
   {
      pFldAttrObj = new FLDCInt8(bBigEndian, FALSE);
      pFldAttrObj->pNamePtr = szAttrFld;
      pFldAttrObj->pDsXml = pDsXml;
   }
Exit:
   return rslt;
}

#if defined(_UNIX)

INT32 GetModuleHandle(pCHAR pszDllName)
{
   // if first argument to dlsym is set to RTLD_DEFAULT, the run-time
   // address of the symbol called NAME in the global scope.
   // TODO: need to investigate further.
   return *((INT32*)dlsym(RTLD_DEFAULT, pszDllName));
}

INT32 LoadString(HINSTANCE hDll, UINT32 iErrCode, pCHAR pResBuffer, INT32 iMaxLen)
{
#if defined(__ANDROID__)
   INT32 iRetval = 0;
   strcpy(pResBuffer, (char*)"unable to load resource file");
   return iRetval;
#else
   const char * szMsgFile = "/.borland/midas.msg"; // { do not localize }
   const char * GLOBALFILE = "/usr/local/etc/midasmsg.conf"; // { Do not localize }
   static nl_catd catd;
   static char cat[DBIMAXPATHLEN + 1];
   INT32 iRetval = 1;
   FILE *f;

   UNREFERENCED_PARAMETER(hDll);
   UNREFERENCED_PARAMETER(iMaxLen);
   if (iErrCode == 0)
      return 0;

