bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
   if (!catd)
   {
      strcpy(cat, getenv("HOME"));
      strncat(cat, szMsgFile, strlen(szMsgFile));
      cat[strlen(cat)] = '\0';

      catd = catopen(cat, 0);
      if (catd == (nl_catd) -1)
      {
         strcpy(pResBuffer, (char*)"unable to load resource file");
         iRetval = 0;
      }
   }
   if (catd != (nl_catd) -1)
      strcpy(pResBuffer, catgets(catd, 1, iErrCode, ""));
   if (pResBuffer[0] == 0)
   {
      catd = catopen(GLOBALFILE, 0);
      if (catd != (nl_catd) -1)
         strcpy(pResBuffer, catgets(catd, 1, iErrCode, ""));
   }
   if (pResBuffer[0] == 0)
      iRetval = 0;
   return iRetval;
#endif
}

BOOL IsEqualCLSID(REFIID riid1, REFIID riid2)
{
   return(memcmp((pVOID) &riid1, (pVOID) &riid2, sizeof(GUID)) == 0);
}
#else
// resource module loader.

static HINSTANCE _hInstance = 0;
static HINSTANCE resHInstance = 0; // HINSTANCE of resource strings

// This function checks if there is an overriding locale which should be used.
//
// The process is as follows:
// Obtain locale override setting from registry.
// If a locale override exists attempt to load it.
// If override module load failed, use the current executable
// If no locale override exists, use OS locales
// If any load failed using OS locales, use old Three-letter locale.
// If any load failed, use the current executable

// translated from System.LoadResourceModule
static char *FindBS(const char *Current)
{
   while (*Current != '\0' && *Current != '\\')
      Current = CharNext(Current);
   return(char*)Current;
}

typedef DWORD (WINAPI *GetLongPathNameFuncProcPtr)(LPCSTR lpszShortPath, LPSTR lpszLongPath, DWORD cchBuffer);

static char *ToLongPath(char *fileName)
{
   int len;
   char *currBS, *nextBS, buffer[FILENAME_MAX];
   HMODULE handle;
   WIN32_FIND_DATA findData;
   GetLongPathNameFuncProcPtr getLongPathNameFunc;

   handle = GetModuleHandle("kernel32.dll");
   if (handle != NULL)
   {
      getLongPathNameFunc = (GetLongPathNameFuncProcPtr)GetProcAddress(handle, "GetLongPathNameA");
      if (getLongPathNameFunc != NULL && getLongPathNameFunc(fileName, buffer, sizeof(buffer)) != 0)
      {
         lstrcpy(fileName, buffer);
         return fileName;
      }
   }

   if (fileName[0] == '\\')
   {
      if (fileName[1] != '\\')
         return fileName;
      currBS = FindBS(fileName + 2); // skip server name
      if (*currBS == '\0')
         return fileName;
      currBS = FindBS(currBS + 1); // skip share name
      if (*currBS == '\0')
         return fileName;
   }
   else
      currBS = fileName + 2; // skip drive name

   len = currBS - fileName;
   lstrcpyn(buffer, fileName, len + 1);
   while (*currBS != '\0')
   {
      nextBS = FindBS(currBS + 1);
      if (len + (nextBS - currBS) + 1 > (int)sizeof(buffer))
         return fileName;
      lstrcpyn(buffer + len, currBS, (nextBS - currBS) + 1);

      handle = (HMODULE)FindFirstFile(buffer, &findData);
      if (handle == INVALID_HANDLE_VALUE)
         return fileName;
      FindClose(handle);

      if (len + 1 + lstrlen(findData.cFileName) + 1 > (int)sizeof(buffer))
         return fileName;
      buffer[len] = '\\';
      lstrcpy(buffer + len + 1, findData.cFileName);
      len += lstrlen(findData.cFileName) + 1;
      currBS = nextBS;
   }
   lstrcpy(fileName, buffer);
   return fileName;
}

typedef BOOL (WINAPI *GetThreadPreferredUILanguagesFuncProcPtr)(DWORD dwFlags, PULONG pulNumLanguages,
   PWSTR pwszLanguagesBuffer, PULONG pcchLanguagesBuffer);

// Copy from winnls.h
#define MUI_LANGUAGE_NAME                   0x8      // Use ISO language (culture) name convention
#define MUI_MERGE_SYSTEM_FALLBACK           0x10     // GetThreadPreferredUILanguages merges in parent and base languages
#define MUI_MERGE_USER_FALLBACK             0x20     // GetThreadPreferredUILanguages merges in user preferred languages
#define MUI_UI_FALLBACK                     MUI_MERGE_SYSTEM_FALLBACK | MUI_MERGE_USER_FALLBACK

static void FindHInstance(void)
{
   static const char *OlderLocaleOverrideKey = "Software\\Borland\\Delphi\\Locales";
   static const char *OldLocaleOverrideKey = "Software\\Borland\\Locales";
   static const char *NewLocaleOverrideKey = "Software\\CodeGear\\Locales";
   static const char *NewerLocaleOverrideKey = "Software\\Embarcadero\\Locales";
   char fileName[260];
   HKEY key;
   char *localeOverride;
   DWORD size;

   localeOverride = NULL;
   if (RegOpenKeyEx(HKEY_CURRENT_USER, NewerLocaleOverrideKey, 0, KEY_READ, &key) == 0 ||
       RegOpenKeyEx(HKEY_LOCAL_MACHINE, NewerLocaleOverrideKey, 0, KEY_READ, &key) == 0 || 
       RegOpenKeyEx(HKEY_CURRENT_USER, NewLocaleOverrideKey, 0, KEY_READ, &key) == 0 ||
       RegOpenKeyEx(HKEY_LOCAL_MACHINE, NewLocaleOverrideKey, 0, KEY_READ, &key) == 0 || 
       RegOpenKeyEx(HKEY_CURRENT_USER, OldLocaleOverrideKey, 0, KEY_READ, &key) == 0 || 
       RegOpenKeyEx(HKEY_CURRENT_USER, OlderLocaleOverrideKey, 0, KEY_READ, &key) == 0 )
   {
      char hostAppName[260];
      GetModuleFileName(0, hostAppName, sizeof(hostAppName));
      if (RegQueryValueEx(key, ToLongPath(hostAppName), NULL, NULL, NULL, &size) == 0)
      {
         localeOverride = new char[size];
         RegQueryValueEx(key, ToLongPath(hostAppName), NULL, NULL, (unsigned char*)localeOverride, &size);
      }
      else if (RegQueryValueEx(key, "", NULL, NULL, NULL, &size) == 0)
      {
         localeOverride = new char[size];
         RegQueryValueEx(key, "", NULL, NULL, (unsigned char*)localeOverride, &size);
      }
      RegCloseKey(key);
   }

   GetModuleFileName(_hInstance, fileName, sizeof(fileName)); // get name of our process

   if (fileName[0] != '\0')
   {
      char *extPart;
      int maxExtLength;

      extPart = fileName + strlen(fileName);
      while (*extPart != '.' && extPart != fileName)
         --extPart;
      if (extPart != fileName)
      {
         ++extPart; // extPart points the top of Extension part.
         maxExtLength = sizeof(fileName)/sizeof(fileName[0]) - (extPart - fileName);

         if ((localeOverride != NULL) && (localeOverride[0] != '\0')) // If override key exist,
         {
            // only look for a local registry override
            // localeOverride is comma-separated string.
            char *p = localeOverride;
            while ((resHInstance == 0) && (*p != '\0'))
            {
               char *commaPtr = p;
               while ((*commaPtr != ',') && (*commaPtr != '\0'))
                  commaPtr++;
               if (*commaPtr == ',')
                  *commaPtr++ = '\0';
               strncpy(extPart, p, maxExtLength);
               resHInstance = LoadLibraryEx(fileName, 0, LOAD_LIBRARY_AS_DATAFILE);
               p = commaPtr;
            }
         }
         else
         {
            HMODULE handle;
            GetThreadPreferredUILanguagesFuncProcPtr GetThreadPreferredUILanguagesFunc = NULL;

