bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
            // GetThreadPreferredUILanguages is existed in Vista or later OS.
            handle = GetModuleHandle("kernel32.dll");
            if (handle != NULL)
               GetThreadPreferredUILanguagesFunc = (GetThreadPreferredUILanguagesFuncProcPtr)GetProcAddress
                  (handle, "GetThreadPreferredUILanguages");
            if (GetThreadPreferredUILanguagesFunc != NULL)
            {
               // When GetThreadPreferredUILanguages exists in OS, This OS is Vista or later version. All W-version APIs are existed.
               ULONG bufSize, numLang;
               bufSize = 0;
               numLang = 0;
               if (GetThreadPreferredUILanguagesFunc(MUI_LANGUAGE_NAME | MUI_UI_FALLBACK, &numLang, NULL, &bufSize))
               {
                  pUCS2Char wp, wBuffer;

                  wBuffer = new ucs2char_t[bufSize];
                  GetThreadPreferredUILanguagesFunc(MUI_LANGUAGE_NAME | MUI_UI_FALLBACK, &numLang, (wchar_t*)wBuffer, &bufSize);

                  wp = wBuffer;
                  if (wBuffer)
                  {
                     while ((*wp != L'\0') && (resHInstance == 0))
                     {
                        wcstombs(extPart, (wchar_t*)wp, maxExtLength);
                        resHInstance = LoadLibraryEx(fileName, 0, LOAD_LIBRARY_AS_DATAFILE);
                        wp += WideStrLen(wp) + 1;
                     }
                     delete[] wBuffer;
                  }
               }
            }
            else
            {
               char language[LOCALE_NAME_MAX_LENGTH];
               char *p;
               int length;

               // A return value of GetLocaleInfo contains NULL-terminator.
               length = GetLocaleInfo(GetThreadLocale(), LOCALE_SISO639LANGNAME, language, LOCALE_NAME_MAX_LENGTH) - 1;
               p = language + length;
               *p = '-';
               GetLocaleInfo(GetThreadLocale(), LOCALE_SISO3166CTRYNAME, p+1, LOCALE_NAME_MAX_LENGTH-(length+1));
               strncpy(extPart, language, maxExtLength);
               resHInstance = LoadLibraryEx(fileName, 0, LOAD_LIBRARY_AS_DATAFILE);
               if (resHInstance == 0)
               {
                  *p = '\0';
                  strncpy(extPart, language, maxExtLength);
                  resHInstance = LoadLibraryEx(fileName, 0, LOAD_LIBRARY_AS_DATAFILE);
               }
            }
            // try old three-letter way.
            if (resHInstance == 0)
            {
               char localeName[4];

               GetLocaleInfo(GetThreadLocale(), LOCALE_SABBREVLANGNAME, localeName, sizeof(localeName));
               strncpy(extPart, localeName, maxExtLength);
               resHInstance = LoadLibraryEx(fileName, 0, LOAD_LIBRARY_AS_DATAFILE);

               if (resHInstance == 0)
               {
                  // finally look for a langauge-only translation
                  localeName[2] = '\0';
                  strncpy(extPart, localeName, maxExtLength);
                  resHInstance = LoadLibraryEx(fileName, 0, LOAD_LIBRARY_AS_DATAFILE);
               }
            }
         }
      }
   }
   if (localeOverride)
      delete[] localeOverride;
   if (resHInstance == 0)
      resHInstance = _hInstance;
}

ULONGP GetResourceModuleHandle(pCCHAR lpModuleName)
{
   if (resHInstance == 0)
   {
      if (lpModuleName)
         _hInstance = (HINSTANCE)GetModuleHandle(lpModuleName);
      else
      {
         const int MAXPATHLENGTH = 260;
         char HostAppName[MAXPATHLENGTH+1];
         DWORD len = GetModuleFileName(0, HostAppName, MAXPATHLENGTH);
         HostAppName[len] = 0;
         _hInstance = (HINSTANCE)GetModuleHandle(HostAppName);
      }
      FindHInstance();
   }
   return reinterpret_cast<ULONGP>(resHInstance);
}

INT32 LoadStringUTF8(HINSTANCE hDll, UINT32 iErrCode, pCHAR pResBuffer, INT32 iMaxLen)
{
   WCHAR wStr[256];
   int wLen, len;

   wLen = LoadStringW(hDll, iErrCode, wStr, sizeof(wStr)/sizeof(*wStr));
   len = WideCharToMultiByte(CP_UTF8, 0, wStr, wLen, pResBuffer, iMaxLen-1, 0, 0);
   pResBuffer[len] = '\0';
   return(len > 0);
}

#endif    // #ifdef _UNIX

HRESULT DBIFN DSDATAPACKET::QueryInterface(REFIID riid, void** ppv)
{
#ifdef MIDAS_DLL
   if (IsEqualCLSID(riid, IID_MDATAPACKETWRITE) || IsEqualCLSID(riid, IID_IUnknown))
#else
      if (IsEqualCLSID(riid, IID_DATAPACKETWRITE) || IsEqualCLSID(riid, IID_IUnknown))
#endif
      {
         if (ppv)
            *ppv = this;
         AddRef();
         return NOERROR;
      }
   if (ppv)
      *ppv = NULL;
   return E_NOINTERFACE;
}

UINT32 DBIFN DSDATAPACKET::AddRef(VOID)
{
   return++iRefCount;
}

UINT32 DBIFN DSDATAPACKET::Release(VOID)
{
   UINT32 iRefSave;

   if (iRefCount > 0)
      iRefSave = --iRefCount;
   else
      iRefSave = iRefCount;
   if (iRefCount == 0)
      delete this;
   return iRefSave;
}

VOID DSDATAPACKET::DelRecStates(VOID)
{
   UINT32 i;

   for (i = 0; i < iRecStatesCnt; i++)
   {
      if (paRecStates[i])
      {
         if (paRecStates[i]->pAdtFieldDesc)
         {
            UINT32 j;
            for (j = 0; j < paRecStates[i]->iAdtColumns; j++)
            {
               if (paRecStates[i]->pAdtFieldDesc[j].pFldObj)
                  delete paRecStates[i]->pAdtFieldDesc[j].pFldObj;
            }
            DsFree(paRecStates[i]->pAdtFieldDesc);
         }
         if (paRecStates[i]->pAttr_List)
            delete paRecStates[i]->pAttr_List;
         if (paRecStates[i]->pFlds_List)
            delete paRecStates[i]->pFlds_List;
         if (paRecStates[i]->pszROW)
            delete[] paRecStates[i]->pszROW;
         delete paRecStates[i];
      }
   }
}

VOID DSEXTRACT::DelRecStates(VOID)
{
   UINT32 i;

   for (i = 0; i < iRecStatesCnt; i++)
   {
      if (paRecStates[i])
      {
         if (paRecStates[i]->pAdtFieldDesc)
         {
            UINT32 j;
            for (j = 0; j < paRecStates[i]->iAdtColumns; j++)
            {
               if (paRecStates[i]->pAdtFieldDesc[j].pFldObj)
                  delete paRecStates[i]->pAdtFieldDesc[j].pFldObj;
            }
            DsFree(paRecStates[i]->pAdtFieldDesc);
         }
         if (paRecStates[i]->pAttr_List)
            delete paRecStates[i]->pAttr_List;
         if (paRecStates[i]->pFlds_List)
            delete paRecStates[i]->pFlds_List;
         if (paRecStates[i]->pszROW)
            delete[] paRecStates[i]->pszROW;
         delete paRecStates[i];
      }
   }
}

