bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
DBIResult DBIFN DSEXTRACT::GetErrorString(DBIResult iErrCode, pCHAR pString)
{
#ifdef _UNIX
   int i;
   if (pString)
   {
      if (LoadString((HINSTANCE)0, iErrCode, pString, DBIMAXMSGLEN) == 0)
      {
         for (i = 0; i < MAXMIDASERRORS; i++)
         {
            if (iErrCode == ResourcedErrorString[i].errorCode)
            {
               strcpy(pString, ResourcedErrorString[i].message);
               return DBIERR_NONE;
            }
         }
         return SetError(DBIERR_OBJNOTFOUND); // resource not found
      }
   }
   return DBIERR_NONE;
#else
   ULONGP hDll;

   if (pString)
   {
      *pString = '\0';
#ifdef MIDAS_OBJ
      // For midaslib, main application contains resources.
      hDll = GetResourceModuleHandle(NULL);
#else
      hDll = GetResourceModuleHandle(szALCHEMYDLL);
#endif
      if (hDll < HINSTANCE_ERROR)
         return SetError(DBIERR_OBJNOTFOUND); // resource not found

      if (LoadString((HINSTANCE)hDll, iErrCode, pString, DBIMAXMSGLEN) == 0)
         return SetError(DBIERR_OBJNOTFOUND); // resource not found
   }
   return DBIERR_NONE;
#endif
}

DBIResult DBIFN DSDATAPACKET::GetErrorString(DBIResult iErrCode, pCHAR pString)
{
#ifdef _UNIX
   int i;
   if (pString)
   {
      if (LoadString((HINSTANCE)0, iErrCode, pString, DBIMAXMSGLEN) == 0)
      {
         for (i = 0; i < MAXMIDASERRORS; i++)
         {
            if (iErrCode == ResourcedErrorString[i].errorCode)
            {
               strcpy(pString, ResourcedErrorString[i].message);
               return DBIERR_NONE;
            }
         }
         return SetError(DBIERR_OBJNOTFOUND); // resource not found
      }
   }
   return DBIERR_NONE;
#else
   ULONGP hDll;

   if (pString)
   {
      *pString = '\0';

#ifdef MIDAS_OBJ
      // For midaslib, main application contains resources.
      hDll = GetResourceModuleHandle(NULL);
#else
      hDll = GetResourceModuleHandle(szALCHEMYDLL);
#endif
      if (hDll < HINSTANCE_ERROR)
         return SetError(DBIERR_OBJNOTFOUND); // resource not found

      if (LoadString((HINSTANCE)hDll, iErrCode, pString, DBIMAXMSGLEN) == 0)
         return SetError(DBIERR_OBJNOTFOUND); // resource not found
   }
   return DBIERR_NONE;
#endif
}

// Create and initialize a new recstate structure, linking it to its caller
DBIResult DBIFN DSDATAPACKET::NewRecState(UINT16 iCols, UINT16 iFieldNo, UINT32 iCurRecState, pUINT32 piRecState,
   pCCHAR pszRowName)
{
   DBIResult rslt = DBIERR_NONE;
   UINT32 iRecState;
   pDSRECState pRecState;

   if (iRecStatesCnt < MAXRECSTATES-1)
   {
      iRecState = ++iRecStatesCnt;
   }
   else
   {
      rslt = SetError(DBIERR_NA);
      goto Exit;
   }

   pRecState = new DSRECState;
   paRecStates[iRecState-1] = pRecState;
   ZeroMem(pRecState, sizeof(DSRECState));
   pRecState->iPrevRecState = iCurRecState;
   pRecState->iParentFieldNo = iFieldNo;
   pRecState->iColumnsInitial = iCols; // Number of fielddescs
   pRecState->pEmbeddedRowCount = NULL;
   pRecState->pAttr_List = NULL;
   pRecState->pFlds_List = new Flds_List(iCols);
   if (pszRowName)
   {
      pRecState->pszROW = new CHAR[(strlen(pszRowName)+2)]; // No parentesis srews up allocator!
      strcpy(pRecState->pszROW, pszRowName);
   }
   else
      pRecState->pszROW = NULL;

   *piRecState = iRecState-1;

Exit:
   return rslt;
}

// Add a column descriptor
DBIResult DBIFN DSDATAPACKET::AddColumnDesc(pDSDATAPACKETFLDDesc pFldDes)
{
   pBYTE pPtr;
   DBIResult rslt = DBIERR_NONE;
   pDSPCKLHdrInfo pHdrInfo;
   BYTE iNameLen;
   UINT32 iSizeAvail;
   UINT32 iRequiredSize;
   pDSRECState pRecState;
   UINT32 iFieldType = pFldDes->iFieldType;
   DSDATAPACKETFLDDescX FldDesX;
   UINT32 iFixedSize = 0;

   ZeroMem((pBYTE) &FldDesX, sizeof(DSDATAPACKETFLDDescX));
   CopyMem((pBYTE) &FldDesX, pFldDes, sizeof(DSDATAPACKETFLDDesc));

   pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
   if (pHdrInfo->iColumnCount < (UINT16)iColumns)
      return SetError(DBIERR_NA);

   if (strcmp(szRowState, pFldDes->szFieldName) == 0)
   {
      rslt = SetError(DBIERR_NA);
      goto Exit;
   }

Again:
   pRecState = paRecStates[iCurRecState];
   if (pRecState->iColumns == pRecState->iColumnsInitial)
   { // Finishing up this level.
      if (iCurRecState)
      {
         if (pRecState->iOptParams == 0)
         {
         }
         if (pDsXml && (pDsXml->iStyle & xmlXMLSCHEMA))
         {
            // pCHAR pzType;
            pBYTE pPos = dsPcklInfo.pFldDescCurrLoc;
            if (pDsXml->bOpenTag)
               pPos = pDsXml->WriteFinishTag(pPos, TRUE);
            else
               pPos = pDsXml->WriteEndTag
                  (pPos, szFIELDDEF /* pRecState->pFieldDesc[pRecState->iColumns-1].szFieldName */ , TRUE);
            dsPcklInfo.pFldDescCurrLoc = pPos;
            dsPcklInfo.pAttrCountLoc = pPos;
            dsPcklInfo.pAttrCurrLoc = pPos;
            dsPcklInfo.pDataCurrLoc = pPos;
         }
         // In case there were no optional parameters for this level, we still need to
         // write the opt. parameter counter to 0.!
         iCurRecState = pRecState->iPrevRecState;
         goto Again;
      }
      else
      { // Giving too many desc.
         rslt = SetError(DBIERR_NA);
         goto Exit;
      }
   }

   // Copy the field descriptor into pFieldDesc member.

   pRecState->pFlds_List->Add((pBYTE) &FldDesX, NULL);
   pRecState->iColumns++;

   if (!bDontStreamColDescs && !(pDsXml && pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED)))
   {
      iRequiredSize = sizeof(DSDATAPACKETFLDDesc)+sizeof(BYTE) +100;
      iSizeAvail = this->iTotalSize - ((pBYTE)dsPcklInfo.pFldDescCurrLoc - (pBYTE)pDataPacketBuf);
      if (iSizeAvail < iRequiredSize)
      {
         rslt = GrowSize(iRequiredSize);
         if (rslt)
            return rslt;
         // After ReAlloc, pHdrInfo points to invalid memory; reset it
         pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
      }
      pPtr = dsPcklInfo.pFldDescCurrLoc;

      // Copy the field descriptor into the pickle.
      iNameLen = (BYTE)LdStrLen(pFldDes->szFieldName);
      *((pBYTE)pPtr) = iNameLen;
      pPtr += sizeof(BYTE);
      memmove((pBYTE)pPtr, (pBYTE)pFldDes->szFieldName, iNameLen);
      pPtr += iNameLen;
      *((pINT32)pPtr) = ConvertInt32(iFieldType);
      pPtr += sizeof(INT32);
      *((pINT16)pPtr) = ConvertInt16(pFldDes->iAttributes);
      pPtr += sizeof(INT16);

      dsPcklInfo.pFldAttrCountLoc = pPtr;
      // Set the optional parameter count.
      *((pUINT16)pPtr) = 0; // ConvertUINT16()
      pPtr += sizeof(UINT16);
      dsPcklInfo.pFldDescCurrLoc = pPtr;

