bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
      // set the number of optional parameter count to zero.
      *((pUINT16)pPtr) = 0; // ConvertUINT16()
      dsPcklInfo.pAttrCountLoc = pPtr;
      dsPcklInfo.pAttrCurrLoc = (pBYTE)pPtr+sizeof(UINT16);
      dsPcklInfo.pDataCurrLoc = (pBYTE)dsPcklInfo.pAttrCurrLoc;
   }
   else
   { // WRITE XMLField
      if (pDsXml && (pDsXml->iStyle & xmlXMLSCHEMA))
      {
         DBINAME szName;
         UINT32 i;
         CHAR ch;
         BOOL bHasSpaces = FALSE, bHasMB = FALSE;

         pCCHAR pzType;
         pBYTE pPos = dsPcklInfo.pFldDescCurrLoc;

         iRequiredSize = 1000;
         iSizeAvail = this->iTotalSize - ((pBYTE)dsPcklInfo.pFldDescCurrLoc - (pBYTE)pDataPacketBuf);

         if (iSizeAvail < iRequiredSize)
         {
            rslt = GrowSize(iRequiredSize);
            if (rslt)
               return rslt;
         }

         if (pRecState->iColumns == 1)
         {
            if (iCurRecState == 0)
            {
               pPos = pDsXml->WriteOpenTag(pPos, szDATAPACKET, TRUE);
               pPos = pDsXml->WriteAttribute(pPos, szVersion, szVersion20);
               pPos = pDsXml->WriteFinishTag(pPos, FALSE);
               pPos = pDsXml->WriteBeginTag(pPos, szMETADATA, NULL, TRUE, TRUE);
            }
            pPos = pDsXml->WriteBeginTag(pPos, szFIELDS, NULL, TRUE, TRUE);
         }
         else
         { // Finish previous field
            if (pDsXml->bOpenTag)
               pPos = pDsXml->WriteFinishTag(pPos, TRUE);
            else
               pPos = pDsXml->WriteEndTag
                  (pPos, szFIELDDEF /* pRecState->pFieldDesc[pRecState->iColumns-2].szFieldName */ , TRUE);
         }

         pPos = pDsXml->WriteOpenTag(pPos, szFIELDDEF, TRUE);
         // Note if fieldname contains spaces, we need to add a special attribute for that

         for (i = 0; i<strlen(FldDesX.szFieldName); i++)
         {
            ch = FldDesX.szFieldName[i];
            if (pDsXml->bUTF8METADATA && ((unsigned char)ch >= 0x80))
            {
               if (pDsXml->bUTF8)
               {
                  szName[i] = ch;
                  i++;
                  ch = FldDesX.szFieldName[i];
               }
               else
               {
                  bHasMB = TRUE;
                  strcpy(szName, "xF");
                  itoa((int)iColumns, &szName[strlen(szName)], 10);
                  goto HasSpaces;
               }
            }
            else if (!pDsXml->bUTF8METADATA && _ismbblead((BYTE)ch))
            {
               if (pDsXml->bUTF8)
               {
                  szName[i] = ch;
                  i++;
                  ch = FldDesX.szFieldName[i];
               }
               else
               {
                  bHasMB = TRUE;
                  strcpy(szName, "xF");
                  itoa((int)iColumns, &szName[strlen(szName)], 10);
                  goto HasSpaces;
               }
            }
            else if (ch == ' '||ch == '('||ch == ')'||ch == '#'||ch == '*'||ch == '!'||ch == '$'||ch == '%'||ch == '?')
            {
               ch = '_';
               bHasSpaces = TRUE;
            }
            szName[i] = ch;
         }
         szName[i] = 0;
      HasSpaces:
         if (bHasSpaces || bHasMB)
         {
            pDSDATAPACKETFLDDescX pFX;
            pPos = pDsXml->WriteAttribute(pPos, szAttrFieldName, FldDesX.szFieldName);

            pFX = pRecState->pFlds_List->GetFldDesc(pRecState->pFlds_List->iLast);
            strcpy(pFX->szFieldName, szName); // Overwrite the value
         }
         if (bAsAttrs)
            pPos = pDsXml->WriteAttribute(pPos, szAttrAttrName, szName);
         else
            pPos = pDsXml->WriteAttribute(pPos, szAttrTagName, szName);

         rslt = XmlMakeType(pFldDes->iFieldType, &pzType, &iFixedSize);
         if (rslt)
            goto Exit;
         pPos = pDsXml->WriteAttribute(pPos, szAttrFieldType, pzType);
         if (pFldDes->iAttributes & fldAttrREADONLY)
            pPos = pDsXml->WriteAttribute(pPos, szAttrReadOnly, "true");
         if (pFldDes->iAttributes & fldAttrREQUIRED)
            pPos = pDsXml->WriteAttribute(pPos, szAttrRequired, "true");
         if (pFldDes->iAttributes & fldAttrHIDDEN)
            pPos = pDsXml->WriteAttribute(pPos, szAttrHidden, "true");
         if (pFldDes->iAttributes & fldAttrLINK)
            pPos = pDsXml->WriteAttribute(pPos, szAttrLinkFld, "true");

         dsPcklInfo.pFldDescCurrLoc = pPos;
         dsPcklInfo.pAttrCountLoc = pPos;
         dsPcklInfo.pAttrCurrLoc = pPos;
         dsPcklInfo.pDataCurrLoc = pPos;
         dsPcklInfo.pInsertionPoint = pPos;
      }
   }

   iFieldType = iFieldType & dsTypeBitsMask;
   iFieldType = iFieldType >> dsSizeBitsLen;
   if (iFieldType > dsfldVERSION_1)
   {
      if (iFieldType > dsfldVERSION_4)
      {
         rslt = SetError(DBIERR_NA);
         goto Exit;
      }
      pHdrInfo->iMajorVer = PICKLEVERSION_2; // Requires a pickle version 2 to unpack
      if (iFieldType == dsfldEMBEDDEDTBL)
      { // Create new level
         UINT16 iCols = (UINT16)pFldDes->iFieldType; // & 0x0000ffff ;
         CHAR szTmp[64];
         pRecState->iColumnsInitial -= iCols; // Adjust this one
         if (pDsXml)
         {
            strcpy(szTmp, szROW);
            strcat(szTmp, pFldDes->szFieldName);
            rslt = NewRecState(iCols, (UINT16)pRecState->iColumns, iCurRecState, &iCurRecState, szTmp);
         }
         else
         {
            rslt = NewRecState(iCols, (UINT16)pRecState->iColumns, iCurRecState, &iCurRecState, NULL);
         }
      }
   }
   // Done in order for reset to work!

   if (pFlds_List)
      pFlds_List->Add((pBYTE) &FldDesX, NULL);
   iColumns++;
   if (pHdrInfo->iColumnCount == (UINT16)iColumns)
   {
      // rslt = ExpandAllFieldDescs(iRecStatesCnt, paRecStates, bBigEndian, pDsXml);
      // if (pDsXml && !(pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED)))
      // {
      // dsPcklInfo.pDataCurrLoc = (pBYTE) dsPcklInfo.pAttrCurrLoc = pDsXml->WriteHead(dsPcklInfo.pDataCurrLoc);
      // }
   }
   if (iFixedSize && !rslt)
   {
      INT16 iLen = (INT16)iFixedSize;
      rslt = this->AddAttribute(fldAttrArea, szWIDTH, dptypeINT16, sizeof(INT16), (pBYTE) &iLen);
   }

