bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
Exit:
   return rslt;
}

// Add an optional parameter
DBIResult DBIFN DSDATAPACKET::AddAttribute(PCKLATTRArea eAttrArea, // fld or pckl optional parameter area.
   pCCHAR pszAttr, // attribute name
   UINT32 iType, // type of attribute
   UINT32 iLen, // length of value
   pBYTE pValue) // value
{
   BYTE iSize;
   pDSPCKLHdrInfo pHdrInfo;
   UINT32 iSizeAvail;
   pBYTE pAttrCurrLoc;
   UINT32 iRequiredSize;
   DBIResult rslt = DBIERR_NONE;
   pDSRECState pRecState = paRecStates[iCurRecState];
   FLDConv * pFldObj = NULL;

   // Make sure addattribute is not called after Addfields is called.
   // i.e., all attributes should be supplied before rows.
   pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
   if (pHdrInfo->iRowCount)
      return SetError(DBIERR_NA);

   if (pDsXml && pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED) && !(pDsXml->iStyle & xmlXMLSCHEMA))
   { // Ignore it
      if (pValue == NULL)
         iCurRecState = pRecState->iPrevRecState;
      goto Exit;
   }

   iSize = (BYTE)(pszAttr ? LdStrLen(pszAttr) : 0);
   iRequiredSize = iSize+sizeof(UINT32) + iLen+sizeof(BYTE);
   if (pDsXml)
      iRequiredSize += 1000;
   iSizeAvail = this->iTotalSize - ((pBYTE)dsPcklInfo.pAttrCurrLoc - (pBYTE)pDataPacketBuf);
   if (iSizeAvail < iRequiredSize)
   {
      rslt = GrowSize(iRequiredSize);
      if (rslt)
         return rslt;
   }

   if (eAttrArea == fldAttrArea)
      pAttrCurrLoc = (pBYTE)dsPcklInfo.pFldDescCurrLoc;
   else
      pAttrCurrLoc = (pBYTE)dsPcklInfo.pAttrCurrLoc;

   // 3 situations : a. fldAttrArea, nested table
   // b.  pcklAttrArea , nested table
   // c.  pcklAttrArea , main table
   if (pValue == NULL /* && eAttrArea == pcklAttrArea */ )
   { // Special case : finish up this level, create entry for next optional parameters

      if (!pDsXml)
      {
         *((pUINT16)pAttrCurrLoc) = 0; // ConvertUINT16()
         dsPcklInfo.pAttrCountLoc = pAttrCurrLoc;
         dsPcklInfo.pFldDescCurrLoc = pAttrCurrLoc; // (pBYTE) dsPcklInfo.pAttrCurrLoc;
         if (iCurRecState !=0)
         { // otherwise it will write it twice
            dsPcklInfo.pAttrCurrLoc = (pBYTE)pAttrCurrLoc+sizeof(UINT16);
         }
         dsPcklInfo.pDataCurrLoc = (pBYTE)dsPcklInfo.pAttrCurrLoc;
      }
      else
      {
         pBYTE pPos = dsPcklInfo.pDataCurrLoc;

         if (eAttrArea != fldAttrArea)
         {

            if (pRecState->iOptParams == 0)
            {
               if (pRecState->iColumns > 0)
               {
                  if (pDsXml->bOpenTag)
                     pPos = pDsXml->WriteFinishTag(pPos, TRUE);
                  else
                  {
                     if (strcmp(pDsXml->LastTag, szFIELDDEF) !=0)
                        pPos = pDsXml->WriteEndTag
                           (pPos, szFIELDDEF /* pRecState->pFieldDesc[pRecState->iColumns-1].szFieldName */ , TRUE);
                  }
               }
               pPos = pDsXml->WriteEndTag(pPos, szFIELDS, TRUE);
               pPos = pDsXml->WriteOpenTag(pPos, szPARAMS, TRUE);
               pPos = pDsXml->WriteFinishTag(pPos, TRUE);

               if (iCurRecState > 0)
               {
                  pDSRECState pRecStatePrev = paRecStates[pRecState->iPrevRecState];
                  if (pRecStatePrev->iColumnsInitial == pRecStatePrev->iColumns)
                     pPos = pDsXml->WriteEndTag(pPos, szFIELDDEF, TRUE); // Otherwise, AddColumn would finish!

               }
               dsPcklInfo.pInsertionPoint = pPos;

            }
            else
            {
               if (pDsXml->bOpenTag)
                  pPos = pDsXml->WriteFinishTag(pPos, TRUE);
               else
               {
                  pPos = pDsXml->WriteEndTag(pPos, szPARAMS, TRUE);

               }
            }
         }

         if (iCurRecState == 0)
            bOptParamsDone = TRUE;

         dsPcklInfo.pFldDescCurrLoc = pPos;
         dsPcklInfo.pAttrCountLoc = pPos;
         dsPcklInfo.pAttrCurrLoc = pPos;
         dsPcklInfo.pDataCurrLoc = pPos;
      }
      iCurRecState = pRecState->iPrevRecState;
      goto Exit;
   }

   if (!pDsXml)
   {
      /*
      TODO:  Error handling for DataSets with no Fields.  (Raid:  264087)
      One of the causes of pAttrCurrLoc being NULL is that there
      are no Fields in a DataSet.  When the LCID attr is added,
      the pAttrCurrLoc is NULL in this case.  In one case of this
      SQLExpr.pas would set FieldDef types to ftUnknown.  Field objects
      were not added for FieldDefs with types of ftUnknown.  We need
      error handling for TDataSets that have FieldDefs, but no Fields.
       */
      *((pBYTE)pAttrCurrLoc) = (BYTE)iSize; // ConvertUINT8()
      pAttrCurrLoc += sizeof(BYTE);
      memmove(pAttrCurrLoc, pszAttr, iSize); // ConvertZTRING()
      pAttrCurrLoc += iSize;
      *(pUINT32)pAttrCurrLoc = ConvertUInt32(iType);
      pAttrCurrLoc += sizeof(UINT32);

      rslt = GetFldObj(iType, bBigEndian, NULL /* pDsXml */ , &pFldObj);
      if (rslt)
         goto Exit;
      // pAttrCurrLoc points to space after opt. parameter

      if ((iType & (dsVaryingFldType))) // NOTE: sfldArrayFldType works fine!
      { // Variable length: length is included in pVale and iLen!
         pValue += pFldObj->iLen;
         iLen -= pFldObj->iLen;
      }

      pAttrCurrLoc = pFldObj->FldPut(pAttrCurrLoc, pValue, iLen);

      // Increment the optional parameter count.
      if (eAttrArea == fldAttrArea)
      {
         // set the number of optional parameter count to zero.
         *((pUINT16)pAttrCurrLoc) = 0; // ConvertUINT8()

         dsPcklInfo.pAttrCountLoc = pAttrCurrLoc;
         dsPcklInfo.pAttrCurrLoc = (pBYTE)pAttrCurrLoc+sizeof(UINT16);
         dsPcklInfo.pDataCurrLoc = (pBYTE)dsPcklInfo.pAttrCurrLoc;

         // Increment count
         dsPcklInfo.pFldDescCurrLoc = pAttrCurrLoc;
         pAttrCurrLoc = (pBYTE)dsPcklInfo.pFldAttrCountLoc;
         *((pUINT16)pAttrCurrLoc) = (UINT16)IncUInt16((*(pUINT16)pAttrCurrLoc));
      }
      else
      {
         pRecState->iOptParams++;
         dsPcklInfo.pAttrCurrLoc = (pBYTE)pAttrCurrLoc;
         dsPcklInfo.pDataCurrLoc = (pBYTE)pAttrCurrLoc;
         dsPcklInfo.pFldDescCurrLoc = pAttrCurrLoc; // KH
         pAttrCurrLoc = (pBYTE)dsPcklInfo.pAttrCountLoc;
         *(pUINT16)pAttrCurrLoc = (UINT16)IncUInt16((*(pUINT16)pAttrCurrLoc));
         if (iCurRecState == 0)
            this->iAttrCnt++;
      }
   }
   else
   { // pDsXml
      pBYTE pPos = pAttrCurrLoc;
      pCCHAR pzType;
      CHAR Tmp[2048];
      pBYTE pTmp;
      BOOL bAsParam = FALSE;
      pCCHAR pName;

      if (eAttrArea != fldAttrArea && pRecState->iOptParams == 0)
      { // First parameter
         if (pRecState->iColumns > 0)
         {
            if (pDsXml->bOpenTag)
            {
               pPos = pDsXml->WriteFinishTag(pPos, TRUE);
            }
            else
            {
               if (strcmp(pDsXml->LastTag, szFIELDDEF) !=0)
                  pPos = pDsXml->WriteEndTag
                     (pPos, szFIELDDEF /* pRecState->pFieldDesc[pRecState->iColumns-1].szFieldName */ , TRUE);
            }
         }
         pPos = pDsXml->WriteEndTag(pPos, szFIELDS, TRUE);
         pPos = pDsXml->WriteOpenTag(pPos, szPARAMS, TRUE);
         dsPcklInfo.pInsertionPoint = pPos;
      }

      rslt = GetFldObj(iType, bBigEndian, pDsXml, &pFldObj);
      if (rslt)
         goto Exit;

      bAsParam = (XmlTypeOfAttr(pszAttr) == NULL);

      if (((iType &dsTypeBitsMask) >> dsSizeBitsLen) == dsfldZSTRING)
      {
         pzType = NULL; // default is string type
      }
      else
      {
         rslt = XmlMakeType(iType, &pzType, NULL);
         if (rslt)
            goto Exit;
      }

      // Workaround: Don't write FIELDPROPS. Bug #116346
      if (stricmp(pszAttr, szFIELDPROPS) == 0)
         goto Exit;

      if (strcmp(pszAttr, szSUBTYPE) == 0 && eAttrArea == fldAttrArea)
      {
         pDSDATAPACKETFLDDescX pFldEntry;
         pFldEntry = pRecState->pFlds_List->GetFldDesc(pRecState->iColumns);
         strcpy(pFldEntry->szSubType, (pCHAR) &pValue[sizeof(UINT16)]);
      }
      if ((iType & (dsVaryingFldType))) // NOTE: sfldArrayFldType works fine!
      { // Variable length: length is included in pVale and iLen!
         pValue += pFldObj->iLen;
         iLen -= pFldObj->iLen;
         if (pValue[iLen-1] == 0 && pzType == NULL) // If zeroterminated and string-type
            iLen--;
      }

