bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
      if (bAsParam)
      {
         if (pDsXml->bOpenTag)
            pPos = pDsXml->WriteFinishTag(pPos, FALSE); // Not empty
         pPos = pDsXml->WriteOpenTag(pPos, szOPTPARAM, TRUE); // <PARAM  ..
         Tmp[0] = 0;
         if (pszAttr)
         {
            strcpy(Tmp, pszAttr); // Could be a readonly string
            pPos = pDsXml->WriteAttribute(pPos, szAttrName, Tmp); // <PARAM name="<pszAttr>"..
         }

         pName = szAttrValue;
         if (pzType == NULL)
         {
            Tmp[0] = 0;
            if (pValue)
            {
               strcpy(Tmp, (pCHAR)pValue); // Could be a readonly string
               pPos = pDsXml->WriteAttribute(pPos, pName, Tmp); // <PARAM name=".." Value=".."
            }
         }
         else
         {
            pTmp = pFldObj->FldPut((pBYTE) &Tmp, pValue, iLen);
            *pTmp = 0;
            pPos = pDsXml->WriteAttribute(pPos, pName, Tmp);
         }
         Tmp[0] = 0;
         if (pzType)
         {
            strcpy(Tmp, (pCHAR)pzType); // Could be a readonly string
            pPos = pDsXml->WriteAttribute(pPos, szAttrType, Tmp);
         }
         if (iType & dsIncInDelta)
         { // Roundtrip bit
            strcpy(Tmp, "True");
            pPos = pDsXml->WriteAttribute(pPos, szROUNDTRIP, Tmp);
         }
         pPos = pDsXml->WriteFinishTag(pPos, TRUE);

      }
      else
      { // As Attribute
         pCHAR pIns = NULL;
         pBYTE pPosSave;

         if ( /* eAttrArea==fldAttrArea && */ dsPcklInfo.pInsertionPoint !=NULL && dsPcklInfo.pInsertionPoint < pPos)
         {
            pIns = new CHAR[600];
            pPosSave = pPos;
            pPos = (pBYTE)pIns;
            *pPos = ' ';
            pPos++;
         }

         pName = pszAttr;
         if (pzType == NULL)
         {
            Tmp[0] = 0;
            if (pValue)
            {
               strcpy(Tmp, (pCHAR)pValue); // Could be a readonly string
               pPos = pDsXml->WriteAttribute(pPos, pName, Tmp); // ..<pszAttr>="<pValue>"
            }
         }
         else
         {
            if (iLen > 100 && iType == 0x820004) // Special case of logfile, array of ints
            {
               UINT32 iCnt = iLen/4;
               UINT32 iSize;
               pBYTE pB, pB1;
               if (iCnt <1000)
                  iSize = iCnt*4;
               else if (iCnt<10000)
                  iSize = iCnt*5;
               else
                  iSize = iCnt*8;
               pB = new BYTE[iSize];
               pB1 = pFldObj->FldPut(pB, pValue, iLen);
               *pB1 = 0;
               pPos = pDsXml->WriteAttribute(pPos, pName, (pCHAR)pB);
               delete pB;
            }
            else
            {
               pTmp = pFldObj->FldPut((pBYTE) &Tmp, pValue, iLen);
               *pTmp = 0;
               pPos = pDsXml->WriteAttribute(pPos, pName, Tmp);
            }
         }
         if (pIns)
         {
            UINT32 iInsLen = (UINT32)(pPos-(pBYTE)pIns);
            UINT32 iMove = pPosSave-dsPcklInfo.pInsertionPoint;
            memmove(dsPcklInfo.pInsertionPoint+iInsLen, dsPcklInfo.pInsertionPoint, iMove);
            memmove(dsPcklInfo.pInsertionPoint, pIns, iInsLen);
            pPos = pPosSave+iInsLen;
            dsPcklInfo.pInsertionPoint = dsPcklInfo.pInsertionPoint+iInsLen;
            delete pIns;
         }
         else
            dsPcklInfo.pInsertionPoint = pPos;
      }

      if (eAttrArea == fldAttrArea)
      {

      }
      else
      {
         pRecState->iOptParams++;
         if (iCurRecState == 0)
            this->iAttrCnt++;
      }
      // StoreAndExit:
      dsPcklInfo.pFldDescCurrLoc = pPos;
      dsPcklInfo.pAttrCountLoc = pPos;
      dsPcklInfo.pAttrCurrLoc = pPos;
      dsPcklInfo.pDataCurrLoc = pPos;
   }

Exit:
   if (pFldObj)
      delete pFldObj;
   return rslt;
}

DBIResult DBIFN DSDATAPACKET::PutField(PCKLFldStauts eFldStatus, // Field Status
   UINT32 iLength, // length of value
   pBYTE pValue) // Pointer to the new field value
{
   DBIResult rslt = DBIERR_NONE;
   UINT32 iType; // type of attribute
   pDSPCKLHdrInfo pHdrInfo;
   UINT32 iSizeAvail;
   UINT32 iRequiredSize;
   UINT32 iLengthInd = 0;
   pBYTE pData, pPtr;

   pDSRECState pRecState = paRecStates[iCurRecState];
   UINT32 iCurrFldNo;
   UINT32 iNestedRows;
   UINT16 iNewState = 0;
   UINT32 iLengthReal;
   pDSPROVADTFLDDesc pAdtFldDes;

   // All column descriptors should be supplied first.
   pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
   if (pHdrInfo->iColumnCount < (UINT16)iColumns)
   {
      rslt = SetError(DBIERR_NA);
      goto Exit;
   }
   if (!pRecState->pAdtFieldDesc)
   {
      rslt = ExpandAllFieldDescs(iRecStatesCnt, paRecStates, bBigEndian, pDsXml);
      if (rslt)
      {
         rslt = SetError(DBIERR_SYSCORRUPT);
         goto Exit;
      }
      if (pDsXml && !(pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED)))
      {
         dsPcklInfo.pDataCurrLoc = pDsXml->WriteHead(dsPcklInfo.pDataCurrLoc);
         dsPcklInfo.pFldDescCurrLoc = dsPcklInfo.pDataCurrLoc;
      }
   }
   iCurrFldNo = pRecState->iCurrFldNo;
   pAdtFldDes = iCurrFldNo ? &pRecState->pAdtFieldDesc[iCurrFldNo-1] : NULL;

   // Just set the unchanged bit and return
   if (!pValue || (eFldStatus == fldIsNull) || eFldStatus == fldIsUnChanged)
   { // Blank field given
      if (iCurrFldNo == 0)
      { // Cannot set a blank on the attribute field
         rslt = SetError(DBIERR_INVALIDPARAM);
         goto Exit;
      }
      if (pDsXml)
      { // Put null-value
         dsPcklInfo.pDataCurrLoc = pAdtFldDes->pFldObj->FldPut(dsPcklInfo.pDataCurrLoc, NULL, 0);
         // Stores length byte and everything
      }
      else
      {
         // null indicators are after the row status field.
         pPtr = pRecState->pRowBeginLoc + pAdtFldDes->iNULLOffs; // Includes 1 for attribute field!
         if (eFldStatus == fldIsUnChanged)
            *pPtr |= pAdtFldDes->iMask2;
         else
            *pPtr |= pAdtFldDes->iMask1;
      }
      goto Finish;
   }

   // Value given
   if (iCurrFldNo == 0)
   {
      if (bFirstRow)
      {
         bFirstRow = FALSE;
         if (pDsXml && !(pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED)))
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteHead(dsPcklInfo.pDataCurrLoc);
      }

