bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
      // Atribute field
      iLengthInd = 0;
      iLength = sizeof(BYTE);
      if (!bMetaDataDone)
      { // First putfield
         UINT32 iOffs;

         if (iCurRecState > 0)
         {
            rslt = SetError(DBIERR_SYSCORRUPT);
            goto Exit;
         }
         bMetaDataDone = TRUE;
         iOffs = (UINT32)(dsPcklInfo.pDataCurrLoc - pDataPacketBuf);
         if (iOffs <= 0xffff)
         {
            pHdrInfo->iReserved = (UINT16)iOffs;
            pHdrInfo->iProperties = (PCKLProps)(pcklpropsCONTAINMETALEN | pHdrInfo->iProperties);
         }
         if (pDsXml)
         {
            if (pDsXml->iStyle & xmlXMLSCHEMA)
            {
               if (pDsXml->bOpenTag)
                  dsPcklInfo.pDataCurrLoc = pDsXml->WriteFinishTag(dsPcklInfo.pDataCurrLoc, TRUE);
               else
               {
                  if (pRecState->iOptParams>0 && strcmp(pDsXml->LastTag, szOPTPARAM) == 0)
                     dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szPARAMS, TRUE);
               }
               // If no parameters (And Addattribute was never called), we need to finish up.
               if (pRecState->iOptParams == 0 && !bOptParamsDone)
               {
                  if (strcmp(pDsXml->LastTag, szOPTPARAM) == 0)
                  {
                     if (strcmp(pDsXml->LastTag, szFIELDDEF) !=0)
                        dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szFIELDDEF, TRUE);
                  }
                  dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szFIELDS, TRUE);
                  dsPcklInfo.pDataCurrLoc = pDsXml->WriteOpenTag(dsPcklInfo.pDataCurrLoc, szPARAMS, TRUE);
                  dsPcklInfo.pDataCurrLoc = pDsXml->WriteFinishTag(dsPcklInfo.pDataCurrLoc, TRUE);
               }

               dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szMETADATA, TRUE);
            }
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteBeginTag(dsPcklInfo.pDataCurrLoc, szDATA, NULL, TRUE, TRUE);
         }
      }
      if (pDsXml)
      {
         if (bAsAttrs)
         {
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteOpenTag(dsPcklInfo.pDataCurrLoc, pRecState->pszROW, TRUE);

            pRecState->pInsertionOffs = dsPcklInfo.pDataCurrLoc-pDataPacketBuf;
         }
         else
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteBeginTag(dsPcklInfo.pDataCurrLoc, pRecState->pszROW, NULL, TRUE,
            TRUE);
      }
   }
   else
   {
      iType = pAdtFldDes->iBaseFieldType; // [iFieldIDParent-1].iFieldType;
      iNewState = pAdtFldDes->iNewRecState;
      if (iNewState)
      {
         paRecStates[iNewState]->pEmbeddedRowCount = NULL;
         iNestedRows = *(pUINT32)pValue; // Could be 0 !
         if (iNestedRows == (UINT32) -1)
         { // Special signal, end-of-rows must be signaled explicitly
            paRecStates[iNewState]->pEmbeddedRowCount = (pUINT32)dsPcklInfo.pDataCurrLoc;
         }
         else
         {
            if (iNestedRows & dsDELAYEDBIT)
               iNestedRows = 0;
         }
      }

      if (!(iType & (dsVaryingFldType | dsArrayFldType)))
      {
         // fixed length field.
         iLength = pAdtFldDes->pFldObj->iLen;
      }
      else
      { // variable length field.
         iLengthInd = pAdtFldDes->pFldObj->iLen;
      }
   }
   if (iLength & dsDELAYEDBIT)
   {
      if (pDsXml)
      {
         rslt = DBIERR_XMLNODELAYEDFETCHING;
         goto Exit;
      }
      iLengthReal = 0;
   }
   else
      iLengthReal = iLength;

   iRequiredSize = iLengthInd + iLengthReal + ((pRecState->iAdtColumns + 3) / 4);
   if (pDsXml)
   {
      iRequiredSize = 2*iRequiredSize+1000; // +1000 pads the buffer for some unkown issue.  Review later.
   }
   iSizeAvail = this->iTotalSize - ((pBYTE)dsPcklInfo.pDataCurrLoc - (pBYTE)pDataPacketBuf);
   if (iSizeAvail < iRequiredSize)
   {
      rslt = GrowSize(iRequiredSize);
      if (rslt)
         goto Exit;
   }

   pData = (pBYTE)dsPcklInfo.pDataCurrLoc;

   if (iCurrFldNo == 0)
   { // Store beginning of row
      if (pDsXml)
      {
         if (pValue && *(pUINT8)pValue !=0)
         {
            pData = pDsXml->WriteAttribute(pData, szRowState, pDsXml->FromINT8(pValue));
         }
      }
      else
      {
         pRecState->pRowBeginLoc = pData;
         // Atribute field (1 BYTE)
         *pData = *pValue;
         pData++;
         // Add the null bytes and set them to zero.
         memset((pBYTE)pData, 0, ((pRecState->iAdtColumns + 3) / 4));
         pData += ((pRecState->iAdtColumns + 3) / 4);
      }
   }
   else
   {
      if (iNewState && pDsXml)
      { // Begin embedding
         pData = pDsXml->WriteBeginTag(pData, pAdtFldDes->pFldObj->pNamePtr, NULL, TRUE, TRUE);
         if (iNestedRows == 0)
            pData = pDsXml->WriteEndTag(pData, pAdtFldDes->pFldObj->pNamePtr, TRUE);

      }
      else
         pData = pAdtFldDes->pFldObj->FldPut(pData, pValue, iLength); // Stores length byte and everything
   }

   dsPcklInfo.pDataCurrLoc = (pBYTE)pData;

Finish:

   ++pRecState->iCurrFldNo;
   if (iNewState && iNestedRows)
   {
      iCurRecState = iNewState;
      pRecState = paRecStates[iNewState];
      pRecState->iRowCountDown = iNestedRows;
      pRecState->iCurrFldNo = 0;
   }
   else // Note: embedded rows could be last field, so do not finish row until rnested rows are done
   {
   Again:
      if (pRecState->iCurrFldNo > pRecState->iAdtColumns)
      {
         if (pDsXml)
         { // Copied below in EndOfNested
            if (bAsAttrs && pDsXml->bOpenTag)
               dsPcklInfo.pDataCurrLoc = pDsXml->WriteFinishTag(dsPcklInfo.pDataCurrLoc, TRUE);
            else
               dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, pRecState->pszROW, TRUE);
         }
         pRecState->iCurrFldNo = 0;
         // Full row was given
         if (iCurRecState == 0)
         { // Update global info
            pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
            pHdrInfo->iRowCount++;
            this->iRows++;
         }
         else
         {
            if (--pRecState->iRowCountDown == 0)
            {
               iCurRecState = pRecState->iPrevRecState; // Done with this level
               pRecState = paRecStates[iCurRecState];
               if (pDsXml)
               {
                  pDSPROVADTFLDDesc pAdtFldDes = &pRecState->pAdtFieldDesc[pRecState->iCurrFldNo-1-1];
                  dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, pAdtFldDes->pFldObj->pNamePtr,
                     TRUE);
               }
               goto Again;
            }
         }
      }
   }
Exit:

   return rslt;
}

DBIResult DBIFN DSDATAPACKET::EndOfNestedRows(VOID)
{
   DBIResult rslt = DBIERR_NONE;
   pDSRECState pRecState = paRecStates[iCurRecState];

   if (pRecState->iCurrFldNo != 0 || pRecState->pEmbeddedRowCount == NULL)
   {
      rslt = SetError(DBIERR_NA);
      goto Exit;
   }
   if (pDsXml)
   {
   }
   else
   {
      *pRecState->pEmbeddedRowCount = ConvertUInt32(((UINT32)(-1)) - pRecState->iRowCountDown);
      pRecState->pEmbeddedRowCount = NULL;
   }

Again:
   iCurRecState = pRecState->iPrevRecState; // Done with this level
   pRecState = paRecStates[iCurRecState];

   if (pDsXml)
   {
      pDSPROVADTFLDDesc pAdtFldDes = &pRecState->pAdtFieldDesc[pRecState->iCurrFldNo-1-1];
      dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, pAdtFldDes->pFldObj->pNamePtr, TRUE);
   }
   if (pRecState->iCurrFldNo > pRecState->iAdtColumns)
   {
      if (pDsXml)
      {
         if (bAsAttrs && pDsXml->bOpenTag)
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteFinishTag(dsPcklInfo.pDataCurrLoc, TRUE);
         else
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, pRecState->pszROW, TRUE);
      }

      pRecState->iCurrFldNo = 0;
      // Full row was given
      if (iCurRecState == 0)
      { // Update global info
         pDSPCKLHdrInfo pHdrInfo;
         pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
         pHdrInfo->iRowCount++;
         this->iRows++;
      }
      else
      {
         if (--pRecState->iRowCountDown == 0)
         {
            goto Again; // Should not happen, since all levels probably uses the method
         }
      }
   }
Exit:
   return rslt;
}

// Return pointer to the finished 'pickle'
DBIResult DBIFN DSDATAPACKET::GetDataPacket(SAFEARRAY **ppPickle)
{
   UINT32 iPickleSize;

