bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
   if (!ppPickle)
      return SetError(DBIERR_INVALIDPARAM);
   if (!bMetaDataDone)
   { // Special-case where datapacket is empty)
      pDSPCKLHdrInfo pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
      UINT32 iOffs = (UINT32)(dsPcklInfo.pDataCurrLoc - pDataPacketBuf);
      if (iOffs <= 0xffff)
      {
         pHdrInfo->iReserved = (UINT16)iOffs;
         pHdrInfo->iProperties = (PCKLProps)(pcklpropsCONTAINMETALEN | pHdrInfo->iProperties);
      }
      if (pDsXml && pDsXml->iStyle & (xmlXMLSCHEMA))
      { // copy from putfield
         pDSRECState pRecState = paRecStates[iCurRecState];

         if (pDsXml->bOpenTag)
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteFinishTag(dsPcklInfo.pDataCurrLoc, TRUE);
         else
         {
            if (pRecState->iOptParams>0 && strcmp(pDsXml->LastTag, szOPTPARAM) == 0)
               dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szPARAMS, TRUE);
         }
         // If no parameters (And Addattribute was never called), we need to finish up.
         if (pRecState->iOptParams == 0 && !bOptParamsDone)
         {
            if (strcmp(pDsXml->LastTag, szOPTPARAM) == 0)
            {
               if (strcmp(pDsXml->LastTag, szFIELDDEF) !=0)
                  dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szFIELDDEF, TRUE);
            }
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szFIELDS, TRUE);
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteOpenTag(dsPcklInfo.pDataCurrLoc, szPARAMS, TRUE);
            dsPcklInfo.pDataCurrLoc = pDsXml->WriteFinishTag(dsPcklInfo.pDataCurrLoc, TRUE);
         }

         dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szMETADATA, TRUE);
      }

      if (pDsXml && pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED))
         dsPcklInfo.pDataCurrLoc = pDsXml->WriteBeginTag(dsPcklInfo.pDataCurrLoc, szDATA, NULL, TRUE, TRUE);

   }
   if (pDsXml)
   {
      dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szDATA, TRUE);
      dsPcklInfo.pDataCurrLoc = pDsXml->WriteEndTag(dsPcklInfo.pDataCurrLoc, szDATAPACKET, TRUE);
   }
   ConvertHeader(bBigEndian, (pVOID)pDataPacketBuf);
   if (pDsXml && pDsXml->iStyle & (xmlUNTYPED | xmlXMLDATATYPED))
   { // Overwrite-header (xml-case)
      pDsXml->WriteHead(pDataPacketBuf);
   }
   else if (pDsXml)
   {
      pDSPCKLHdrInfo pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
      pHdrInfo->iProperties = (PCKLProps)(pHdrInfo->iProperties | 0x8000);
   }

   GetSize(&iPickleSize);
   SATruncate(pSa, iPickleSize);

   *ppPickle = (SAFEARRAY*)pSa;
   return DBIERR_NONE;
}

// Get the size of the pickle.
DBIResult DBIFN DSDATAPACKET::GetSize(pUINT32 piPickleSize)
{
   pDSPCKLHdrInfo pHdrInfo;

   if (!piPickleSize)
      return SetError(DBIERR_INVALIDPARAM);
   *piPickleSize = 0;

   pHdrInfo = (pDSPCKLHdrInfo)pDataPacketBuf;
   // If rows or dataset attributes exist.
   if (pHdrInfo->iRowCount || this->iAttrCnt || this->iColumns)
      *piPickleSize = ((pBYTE)dsPcklInfo.pDataCurrLoc - (pBYTE)pDataPacketBuf);
   else
      *piPickleSize = ((pBYTE)dsPcklInfo.pFldDescCurrLoc - (pBYTE)pDataPacketBuf);
   return DBIERR_NONE;
}

DBIResult DSDATAPACKET::GrowSize(UINT32 iSize) // required size
{
   pBYTE pNewBuf;
   UINT32 i;

   // Alternatively double the memory size
   if (bNoOfBufAllocs)
   {
      if ((iSize < this->iTotalSize) && (iSize < DSMAXPCKLALLOCSIZE))
      {
         iSize = this->iTotalSize;
         if (iSize > DSMAXPCKLALLOCSIZE)
            iSize = DSMAXPCKLALLOCSIZE;
      }
      bNoOfBufAllocs = FALSE;
   }
   else
   {
      if (iSize < DSPCKLINITSIZE)
         iSize = DSPCKLINITSIZE;
      bNoOfBufAllocs = TRUE;
   }

   pNewBuf = (pBYTE)SARealloc(pSa, (this->iTotalSize + iSize));
   if (!pNewBuf)
      return SetError(DBIERR_NOMEMORY);

   this->iTotalSize += iSize;
   if (dsPcklInfo.pFldDescCurrLoc)
      dsPcklInfo.pFldDescCurrLoc = pNewBuf + (dsPcklInfo.pFldDescCurrLoc - pDataPacketBuf);
   for (i = 0; i < iRecStatesCnt; i++)
   {
      pDSRECState pRecState = paRecStates[i];

      if (pRecState && pRecState->pRowBeginLoc)
      {
         pRecState->pRowBeginLoc = pNewBuf + (pRecState->pRowBeginLoc - pDataPacketBuf);
      }
      if (pRecState && pRecState->pEmbeddedRowCount)
      {
         pRecState->pEmbeddedRowCount = (pUINT32)(pNewBuf + ((pBYTE)pRecState->pEmbeddedRowCount - pDataPacketBuf));
      }
   }
   if (dsPcklInfo.pAttrCurrLoc)
      dsPcklInfo.pAttrCurrLoc = pNewBuf + (dsPcklInfo.pAttrCurrLoc - pDataPacketBuf);
   if (dsPcklInfo.pDataCurrLoc)
      dsPcklInfo.pDataCurrLoc = pNewBuf + (dsPcklInfo.pDataCurrLoc - pDataPacketBuf);
   if (dsPcklInfo.pFldAttrCountLoc)
      dsPcklInfo.pFldAttrCountLoc = pNewBuf + (dsPcklInfo.pFldAttrCountLoc - pDataPacketBuf);
   if (dsPcklInfo.pAttrCountLoc)
      dsPcklInfo.pAttrCountLoc = pNewBuf + (dsPcklInfo.pAttrCountLoc - pDataPacketBuf);

   if (dsPcklInfo.pInsertionPoint)
      dsPcklInfo.pInsertionPoint = pNewBuf + (dsPcklInfo.pInsertionPoint - pDataPacketBuf);

   // Update paRecState

   pDataPacketBuf = pNewBuf;
   return DBIERR_NONE;
}

// Reset all data (in order to create partial data)
// Datapackets will not contain meta-info.
DBIResult DBIFN DSDATAPACKET::Reset(VOID)
{
   if (iColumns == 0)
      return SetError(DBIERR_NA);
   memset((pBYTE) &dsPcklInfo, 0, sizeof(DSPCKLInfo));
   Init(0, (UINT16)iColumns, NULL);
   iAttrCnt = 0;
   iRows = 0;
   return DBIERR_NONE;
}

// Return number of fielddescriptors, including embedded tables etc.
// (Same as iColumns above, only for external COM-users)
DBIResult DBIFN DSDATAPACKET::GetColumnCount(pUINT32 piCount)
{
   *piCount = iColumns;
   return DBIERR_NONE;
}

// Return all fielddescriptors
// (Same as pFieldDesc above, only for external COM-users)
DBIResult DBIFN DSDATAPACKET::GetColumnDescs(pDSDATAPACKETFLDDesc pFldDes)
{
   if (pFlds_List)
   {
      UINT32 i;
      for (i = 0; i<iColumns; i++)
         memmove((pBYTE) &pFldDes[i], (pBYTE)pFlds_List->GetEntry(i+1), sizeof(DSDATAPACKETFLDDesc));
   }
   return DBIERR_NONE;
}

// =======================================================================
// Interfaces to Pickle Extract Class
// =======================================================================

