bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
DBIResult dsCheckPickle(pBYTE pPickle)
{
   if (((DSPCKLHDRInfo*)pPickle)->iMagicNo != MAGICCOOKIE && ((DSPCKLHDRInfo*)pPickle)->iMagicNo != MAGICCOOKIEOLD)
      return SetError(DBIERR_DATAPACKETMISMATCH); // DBIERR_INVALIDPICKLE;

   if (((DSPCKLHDRInfo*)pPickle)->iMagicNo != MAGICCOOKIEOLD && (((DSPCKLHDRInfo*)pPickle)
         ->iMinorVer > MAX_PICKLEVERSION || ((DSPCKLHDRInfo*)pPickle)->iMajorVer > MAX_PICKLEVERSION))
      return SetError(DBIERR_DATAPACKETMISMATCH); // DBIERR_INVALIDPICKLEVERSION;

   return DBIERR_NONE;
}

DSEXTRACT::DSEXTRACT(VOID)
{
   InitObj();
   iRefCount = 0;
   iObjCount++;
}

DSEXTRACT::~DSEXTRACT()
{
   if (pFldAttrObj)
      delete pFldAttrObj;
   DelRecStates();
   if (pDsXml)
      delete pDsXml;
   iObjCount--;
}

// Initializes all values
VOID DSEXTRACT::InitObj()
{
   // Public values
   iAttrCnt = 0;
   iColumns = 0;
   iRows = 0;
   iProperties = (PCKLProps)0;
   iAttrCurrent = 1;
   iRowCurrent = 1;
   iFieldCurrent = 0;

   // Private variables
   bFldOptParams = FALSE;
   bMetaDataDone = FALSE;
   pCurrPos = NULL;
   iCurRecState = 0;
   iRecStatesCnt = 0;

   memset(paRecStates, 0, sizeof(paRecStates));

   pSa = NULL;
   bBigEndian = FALSE;
   memset(&HdrInfo, 0, sizeof(DSPCKLHDRInfo));
   pFldAttrObj = NULL;
   pDsXml = NULL;
   bFirstRow = FALSE; // TRUE
   bEndOfThisLevel = FALSE; // XML
   bUTF8METADATA = FALSE;
   iANSICodePage = 0;
   return;
}

DBIResult DBIFN DSEXTRACT::SetMETADATAMode(BOOL bMETADATAMode)
{
   bUTF8METADATA = bMETADATAMode;
   return DBIERR_NONE;
}

DBIResult DBIFN DSEXTRACT::SetANSICodePage(INT32 iCodePage)
{
   iANSICodePage = iCodePage;
   return DBIERR_NONE;
}

DBIResult DBIFN DSEXTRACT::Init(SAFEARRAY *pSa)
{
   DBIResult rslt = DBIERR_NONE;
   pBYTE pPickle;
   pDSPCKLHdrInfo pHdrInfo;

   if (!pSa)
   {
      rslt = SetError(DBIERR_NA);
      goto Exit;
   }

   pPickle = (pBYTE)SAGetPtr((SAFEARRAY*)pSa);
   if (!pPickle)
   {
      rslt = SetError(DBIERR_NA);
      goto Exit;
   }

   // version control.
   if (dsCheckPickle(pPickle))
   {
      SARelPtr(pSa);
      return XMLInitExtract(pSa);
   }
   pHdrInfo = (pDSPCKLHdrInfo)pPickle;
   memmove(&HdrInfo, pHdrInfo, sizeof(DSPCKLHDRInfo));
   ConvertHeader(bBigEndian, (pVOID) &HdrInfo);

   if (HdrInfo.iProperties & 0x8000)
   { // Data is in XML
      pDsXml = new DSXML_W(); // default
      pDsXml->Init(0, FALSE, 5, TRUE, FALSE, iANSICodePage);
      bFirstRow = TRUE;
   }

   iColumns = HdrInfo.iColumnCount;
   iRows = HdrInfo.iRowCount;

   if (HdrInfo.iProperties & pcklpropsMETADATA_INCL)
      iProperties = (PCKLProps)pcklpropsMETADATA_INCL;

   NewRecState(iColumns, 0, 0, &iCurRecState);
   pCurrPos = (pBYTE)pPickle + HdrInfo.iHeaderSize;
   this->pSa = (SAFEARRAY*)pSa;
   if (pDsXml && !pFldAttrObj)
   {
      pFldAttrObj = new FLDCInt8(bBigEndian, FALSE);
      pFldAttrObj->pNamePtr = szAttrFld;
      pFldAttrObj->pDsXml = pDsXml;
   }
   SARelPtr(pSa);
Exit:

   return rslt;
}

HRESULT DBIFN DSEXTRACT::QueryInterface(REFIID riid, void** ppv)
{
#ifdef MIDAS_DLL
   if (IsEqualCLSID(riid, IID_MDATAPACKETREAD) || IsEqualCLSID(riid, IID_IUnknown))
#else
      if (IsEqualCLSID(riid, IID_DATAPACKETREAD) || IsEqualCLSID(riid, IID_IUnknown))
#endif
      {
         if (ppv)
            *ppv = this;
         AddRef();
         return NOERROR;
      }
   if (ppv)
      *ppv = NULL;
   return E_NOINTERFACE;
}

UINT32 DBIFN DSEXTRACT::AddRef(VOID)
{
   return++iRefCount;
}

UINT32 DBIFN DSEXTRACT::Release(VOID)
{
   UINT32 iRefSave;

   if (iRefCount > 0)
      iRefSave = --iRefCount;
   else
      iRefSave = iRefCount;
   if (iRefCount == 0)
      delete this;
   return iRefSave;
}

// Create and initialize a new recstate structure, linking it to its caller
DBIResult DBIFN DSEXTRACT::NewRecState(UINT16 iCols, UINT16 iFieldNo, UINT32 iCurRecState, pUINT32 piRecState)
{
   DBIResult rslt = DBIERR_NONE;
   UINT32 iRecState;
   pDSRECState pRecState;

   if (iRecStatesCnt < MAXRECSTATES-1)
   {
      iRecState = ++iRecStatesCnt;
   }
   else
   {
      rslt = SetError(DBIERR_NA);
      goto Exit;
   }

   pRecState = new DSRECState;
   paRecStates[iRecState-1] = pRecState;
   ZeroMem(pRecState, sizeof(DSRECState));
   pRecState->iPrevRecState = iCurRecState;
   pRecState->iParentFieldNo = iFieldNo;
   pRecState->iColumnsInitial = iCols; // Number of fielddescs
   pRecState->pEmbeddedRowCount = NULL;
   pRecState->pAttr_List = new Attr_List(NULL);
   pRecState->pFlds_List = new Flds_List(iCols);
   pRecState->pszROW = NULL;
   *piRecState = iRecState-1;

Exit:
   return rslt;
}

// Adds additional 'partial' pickle for extraction
DBIResult DBIFN DSEXTRACT::AddDataPacket(SAFEARRAY *pSa)
{
   DBIResult rslt;
   pBYTE pPickle;
   pDSPCKLHdrInfo pHdrInfo;

   if (!pSa)
      return SetError(DBIERR_INVALIDPARAM);

   pPickle = (pBYTE)SAGetPtr((SAFEARRAY*)pSa);
   if (!pPickle)
      return SetError(DBIERR_INVALIDPARAM);

   // version control.
   if (pDsXml)
      return XMLAddDataPacket(pSa, pPickle);

   rslt = dsCheckPickle(pPickle);
   if (rslt)
   {
      SARelPtr(pSa);
      return XMLAddDataPacket(pSa, pPickle);
   }

   pHdrInfo = (pDSPCKLHdrInfo)pPickle;
   memmove(&HdrInfo, pHdrInfo, sizeof(DSPCKLHDRInfo));
   ConvertHeader(bBigEndian, (pVOID) &HdrInfo);

   iColumns = HdrInfo.iColumnCount;
   iRows = HdrInfo.iRowCount;
   this->pSa = (SAFEARRAY*)pSa;
   iProperties = (PCKLProps)0;
   if (HdrInfo.iProperties & pcklpropsMETADATA_INCL)
      iProperties = (PCKLProps)(iProperties | pcklpropsMETADATA_INCL);

   if (HdrInfo.iProperties & pcklpropsCONTAINMETALEN)
      iProperties = (PCKLProps)(iProperties | pcklpropsCONTAINMETALEN);

   iRowCurrent = 1;
   if (HdrInfo.iProperties & pcklpropsCONTAINMETALEN)
   {
      pCurrPos = (pBYTE)pPickle + HdrInfo.iReserved;
      if (iRows == 0)
         this->pSa = NULL;
   }
   else
      pCurrPos = (pBYTE)pPickle + HdrInfo.iHeaderSize; // sizeof(DSPCKLHdrInfo);

   SARelPtr(this->pSa);
   return DBIERR_NONE;
}

DBIResult DBIFN DSEXTRACT::XMLAddDataPacket(SAFEARRAY *pSa, pBYTE pPickle)
{
   DBIResult rslt;
   UINT32 iXmlLen = pSa->rgsabound[0].cElements;

   if (pDsXml == NULL)
   {
      pDsXml = new DSXML_W();
      rslt = pDsXml->Init(0, FALSE, 0, TRUE, bUTF8METADATA, iANSICodePage);
      if (!rslt)
         goto Exit;
   }

   rslt = pDsXml->pXmlParse->Init(iXmlLen, (pCHAR)pPickle);
   if (rslt)
   {
      rslt = SetError(DBIERR_NA); // other code!
      goto Exit;
   }

