bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
   iRows = (UINT32) -1;
   this->pSa = (SAFEARRAY*)pSa;

   iProperties = (PCKLProps)0;
   iRowCurrent = 1;

   if (!bMetaDataDone)
   {
      rslt = ExpandAllFieldDescs(iRecStatesCnt, paRecStates, FALSE, pDsXml);
      if (!rslt)
         goto Exit;
      bMetaDataDone = TRUE;
   }
   if (!pFldAttrObj)
   {
      pFldAttrObj = new FLDCInt8(bBigEndian, FALSE);
      pFldAttrObj->pNamePtr = szAttrFld;
   }

Exit:
   return rslt;
}

UINT32 DBIFN DSEXTRACT::GetXMLMode(VOID)
{
   if (pDsXml)
      return pDsXml->iStyle;
   return 0;
}

DBIResult DBIFN DSEXTRACT::SetXMLMode(INT iMode)
{
   if (iMode && pDsXml == NULL)
   {
      pDsXml = new DSXML_W();
      pDsXml->Init(3, TRUE, iMode, TRUE, bUTF8METADATA, iANSICodePage);
   }
   return DBIERR_NONE;
}

// Extract the next column descriptor.
DBIResult DBIFN DSEXTRACT::GetColumnDesc(pDSDATAPACKETFLDDesc pFldDes)
{
   DBIResult rslt = DBIERR_NONE;
   pBYTE pPtr;
   BYTE iNameLen;
   UINT32 iNameLenSafe;
   pDSRECState pRecState = paRecStates[iCurRecState];
   UINT32 iFieldType;
   DSDATAPACKETFLDDescX FldDesX;

   ZeroMem((pBYTE) &FldDesX, sizeof(DSDATAPACKETFLDDescX));

   if (pDsXml)
      return XMLGetColumnDesc(pFldDes);

   if (bMetaDataDone)
   {
      rslt = SetError(DBIERR_EOF);
      goto Exit;
   }
   if (!pFldDes)
   {
      rslt = SetError(DBIERR_INVALIDPARAM);
      goto Exit;
   }

   if (pRecState->iColumns == pRecState->iColumnsInitial)
   {
      rslt = SetError(DBIERR_EOF);
      goto Exit;
   }
   if (iAttrCurrent <= iAttrCnt)
   {
      rslt = SetError(DBIERR_NA); // Reading attributes!
      goto Exit;
   }

   pPtr = pCurrPos;
   iNameLen = *((pBYTE)pPtr); // ConvertInt8()
   pPtr += sizeof(BYTE);
   iNameLenSafe = iNameLen;
   if (iNameLen > DBIMAXNAMELEN)
      iNameLenSafe = DBIMAXNAMELEN;

   if (iNameLen == 0)
   {
      // Field name can't be an empty string. T.Ramesh - 05/15/2002.
      rslt = SetError(DBIERR_INVALIDFIELDNAME);
      goto Exit;
   }

   // copy the field descriptor information
   memmove(pFldDes->szFieldName, pPtr, iNameLenSafe); // ConvertZString
   pFldDes->szFieldName[iNameLenSafe] = 0;

   pPtr += iNameLen;

   pFldDes->iFieldType = ConvertInt32(*((pINT32)pPtr));
   pPtr += sizeof(INT32);
   pFldDes->iAttributes = ConvertInt16(*((pINT16)pPtr));
   pPtr += sizeof(INT16);

   // Copy to local fielddesc
   CopyMem((pBYTE) &FldDesX, pFldDes, sizeof(DSDATAPACKETFLDDesc));
   pRecState->pFlds_List->Add((pBYTE) &FldDesX, NULL);

   // Get the attribute count.
   bFldOptParams = TRUE;
   iAttrCurrent = 1;
   iAttrCnt = ConvertInt16(*((pUINT16)pPtr));
   pPtr += sizeof(UINT16);

   pCurrPos = pPtr;

   iFieldCurrent++;
   pRecState->iColumns++;

   iFieldType = pFldDes->iFieldType & dsTypeBitsMask;
   if ((iFieldType = iFieldType >> dsSizeBitsLen) == dsfldEMBEDDEDTBL)
   { // Create new level
      UINT16 iCols = (UINT16)pFldDes->iFieldType; // & 0x0000ffff ;
      pRecState->iColumnsInitial -= iCols; // Adjust this one
      rslt = NewRecState(iCols, (UINT16)pRecState->iColumns, iCurRecState, &iCurRecState);
   }

Exit:
   return rslt;
}

// Get length of next attribute
// Returns DBIERR_EOF if no more attributes
DBIResult DBIFN DSEXTRACT::GetAttributeLength(pUINT32 piLength)
{
   DBIResult rslt;

   *piLength = (UINT32)(-1);
   rslt = GetNextAttribute(NULL, NULL, piLength, NULL);
   return rslt;
}

// Extract next attribute
DBIResult DBIFN DSEXTRACT::GetNextAttribute(pCHAR pszAttribute, // Attribute
   pUINT32 piType, // Attribute type
   pUINT32 piLen, // lenght of pValue buffer, if applicable
   pBYTE pValue) // value
{
   pBYTE pPtr;
   DBIResult rslt = DBIERR_NONE;
   UINT32 iType;
   UINT32 iLength;
   BYTE iNameLen;
   pDSRECState pRecState = paRecStates[iCurRecState];
   FLDConv *pFldObj = NULL;

   if (pDsXml)
      return XMLGetNextAttribute(pszAttribute, piType, piLen, pValue);

   if (bMetaDataDone)
   {
      rslt = SetError(DBIERR_EOF);
      goto Exit;
   }

   if (iAttrCurrent > iAttrCnt)
   { // No more optional parameters
      if (bFldOptParams)
      {
      Again:
         if (pRecState->iColumns == pRecState->iColumnsInitial)
         {
            bFldOptParams = FALSE;
            iAttrCurrent = 1;
            iAttrCnt = ConvertInt16(*((pUINT16)pCurrPos));
            pCurrPos += sizeof(UINT16);
         }
      }
      else
      {
         if (pRecState->iColumns == pRecState->iColumnsInitial)
         { // State transition! Already read last optional parameters at this level.
            //
            if (iCurRecState == 0)
            { // This point only reached once
               // Start reading rowdata, if any
               // iFieldCurrent == Columns)!
               bMetaDataDone = TRUE;

               if (iRowCurrent > iRows)
               {
                  if (this->pSa)
                     SARelPtr(this->pSa);
                  this->pSa = NULL;
               }
               // initialize all AdtFielddescs
               rslt = ExpandAllFieldDescs(iRecStatesCnt, paRecStates, bBigEndian, pDsXml);
            }
            else
            {
               iCurRecState = pRecState->iPrevRecState; // Done with this level
               pRecState = paRecStates[iCurRecState];
               goto Again;
            }
         }
      }
      rslt = SetError(DBIERR_EOF);
      goto Exit; // Signal end of field-optional parameters
   }

   // Read the attribute

   pPtr = pCurrPos;
   iNameLen = *((pBYTE)pPtr); // ConvertInt16
   pPtr += sizeof(BYTE);

   if (pszAttribute)
   { // Get attribute name
      memmove(pszAttribute, pPtr, iNameLen); // ConvertZString()
      pszAttribute[iNameLen] = 0;
   }
   pPtr += iNameLen;

   // Extract the attribute type and length of the value.
   iType = ConvertInt32(*((pUINT32)pPtr));
   if (piType)
      *piType = iType;
   pPtr += sizeof(UINT32);

   rslt = GetFldObj(iType, bBigEndian, NULL /* pDsXml */ , &pFldObj);
   if (rslt)
      goto Exit;

   pFldObj->FldGet(NULL, pPtr, &iLength, NULL);
   if (piLen)
   {
      if (*piLen < iLength)
      {
         *piLen = iLength;
         rslt = SetError(DBIERR_INVALIDPARAM);
         goto Exit;
      }
      *piLen = iLength;
   }

