bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
   // Extract the value of the attribute.
   if (pValue)
   {
      pPtr = pFldObj->FldGet(pValue, pPtr, NULL, NULL);
   }

   if (pszAttribute && pValue) // Otherwise just the length i sreturned
   {
      iAttrCurrent++;
      pCurrPos = pPtr;
   }

Exit:
   if (pFldObj)
      delete pFldObj;
   return rslt;
}

// Get length of next field
DBIResult DBIFN DSEXTRACT::GetFieldLength(pUINT32 piLength)
{
   DBIResult rslt;

   *piLength = (UINT32)(-1);
   rslt = GetField(piLength, NULL, NULL);
   if (rslt == DBIERR_FIELDISBLANK)
      rslt = DBIERR_NONE;
   return rslt;
}

DBIResult DBIFN DSEXTRACT::GetField(pUINT32 piLength, // length of value in/out
   pBYTE pValue, // Pointer to the new field value
   pBOOL pBlank) // Pointer to the new field value
{
   DBIResult rslt = DBIERR_NONE;
   UINT32 iType; // type of attribute
   UINT32 iLength; // length of value
   pBYTE pDataCurrLoc, pPtr;
   pDSRECState pRecState = paRecStates[iCurRecState];
   UINT32 iNestedRows;
   UINT32 iCurrFldNo;
   UINT16 iNewState = 0;
   pDSPROVADTFLDDesc pAdtFldDes;

   if (pDsXml)
      return XMLGetField(piLength, pValue, pBlank);

   // Should get the field descriptors first.
   if (!bMetaDataDone)
      return SetError(DBIERR_NA);
   if (pSa == NULL)
      return SetError(DBIERR_EOF);

   if (pValue && (!piLength || *piLength < 1))
   {
      rslt = SetError(DBIERR_INVALIDPARAM);
      goto Exit;
   }

   iCurrFldNo = pRecState->iCurrFldNo;
   pAdtFldDes = iCurrFldNo ? &pRecState->pAdtFieldDesc[iCurrFldNo-1] : NULL;
   pDataCurrLoc = pCurrPos;
   if (iCurrFldNo == 0)
   {
      pRecState->pRowBeginLoc = pDataCurrLoc;
      iLength = sizeof(BYTE);
      if (pValue)
      {
         *pValue = ConvertInt8(*((pBYTE)pRecState->pRowBeginLoc));
      }
      // increment it past to the null bytes.
      pDataCurrLoc += (iLength + ((pRecState->iAdtColumns + 3) / 4));
      if (pBlank)
         *pBlank = (BOOL)fldIsChanged;
      goto Finish;
   }

   // See if null indicator is set for this field.
   // null indicators are after the row status field.
   // Note that if this is a fldTABLE, and the field is NULL, we do not need to go
   // to 'new state'
   pPtr = pRecState->pRowBeginLoc + pAdtFldDes->iNULLOffs;
   if (*pPtr & pAdtFldDes->iMask1) // (1 << (((iCurrFldNo - 1) % 4) * 2)))
   {
      iLength = 0;
      if (pBlank)
         *pBlank = (BOOL)fldIsNull;
      rslt = SetError(DBIERR_FIELDISBLANK);
      goto Finish;
   }
   // see if the unchanged bit is set.
   if (*pPtr & pAdtFldDes->iMask2) // (1 << ((((iCurrFldNo - 1) % 4) * 2) + 1)))
   {
      iLength = 0;
      if (pBlank)
         *pBlank = (BOOL)fldIsUnChanged;
      goto Finish;
   }

   if (pBlank)
      *pBlank = (BOOL)fldIsChanged;

   // GetValue:
   // Interpret the value
   iType = pAdtFldDes->iBaseFieldType;
   iNewState = pAdtFldDes->iNewRecState;

   if (!(iType & (dsVaryingFldType | dsArrayFldType)))
   {
      // fixed length field.
      iLength = pAdtFldDes->pFldObj->iLen;
   }
   else
   { // variable length field.
      pAdtFldDes->pFldObj->FldGet(NULL, pDataCurrLoc, &iLength, NULL);
      // Just get the length (Arrays include the repeatcount!)
   }

   if (*piLength < iLength && !(iLength & dsDELAYEDBIT))
   {
      rslt = SetError(DBIERR_INVALIDPARAM);
      goto Exit;
   }

   pDataCurrLoc = pAdtFldDes->pFldObj->FldGet(pValue, pDataCurrLoc, &iLength, /* bXML ?pBlank: */ NULL);

   if (!pValue)
      goto Finish;

   if (iNewState)
   {
      iNestedRows = *(pUINT32)pValue; // Could be 0 !
      if (iNestedRows & dsDELAYEDBIT)
         iNestedRows = 0;
   }

Finish:

   *piLength = iLength;
   if (!pValue && !pBlank) // This is a 'GetFieldLength'.Do not increment
      goto Exit;

   // Only increment if pValue is set!
   pCurrPos = pDataCurrLoc;
   ++pRecState->iCurrFldNo;

   if (iNewState && iNestedRows)
   {
      iCurRecState = iNewState;
      pRecState = paRecStates[iNewState];
      pRecState->iRowCountDown = iNestedRows;
      pRecState->iCurrFldNo = 0;
   }
   else // Note: embedded rows could be last field, so do not finish row until rnested rows are done
   {
   Again:
      if (pRecState->iCurrFldNo > pRecState->iAdtColumns)
      {
         pRecState->iCurrFldNo = 0;
         // Full row was given
         if (iCurRecState == 0)
         { // Update global info
            if (++iRowCurrent > iRows)
            { // We are DONE,
               if (this->pSa)
                  SARelPtr(this->pSa);
               this->pSa = NULL;
            }
         }
         else
         {
            if (--pRecState->iRowCountDown == 0)
            {
               iCurRecState = pRecState->iPrevRecState; // Done with this level
               pRecState = paRecStates[iCurRecState];
               goto Again;
            }
         }
      }
   }
Exit:
   return rslt;
}


FLDConv::FLDConv()
{
   pNamePtr = NULL;
   pDsXml = NULL;
   pXmlType = NULL;
}

FLDConv::~FLDConv()
{
}

pBYTE FLDConv::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iLen)
{
   if (pDsXml)
   {
      pPos = pDsXml->WriteValue(pPos, pNamePtr, pXmlType, (pCHAR)pVal);
      return pPos;
   }
   memmove(pPos, pVal, iLen);
   return pPos + iLen;
}

// base type
pBYTE FLDConv::FldGet(pBYTE pStr, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{

   if (pDsXml)
   {
      if (pPos)
      {
         pDsXml->ReadStr((pCHAR)pPos, (pCHAR)pStr, piLen, NULL);
      }
      return NULL;
   }

   if (pStr)
   {
      memmove(pStr, pPos, iLen);
   }
   if (piLen)
      *piLen = iLen;
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

// ZSTRING
FLDCVar8::FLDCVar8()
{
}

FLDCVar8::~FLDCVar8()
{
}

FLDCVar8::FLDCVar8(BOOL bConvert)
{
   iLen = 1;
   this->bConvert = bConvert;
}

pBYTE FLDCVar8::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iVarLen)
{
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromSTRING(pVal, &iVarLen); // Creates a new encoded string of length iVarLen
      return pDsXml->WriteValueLen(pPos, pNamePtr, pXmlType, (pCHAR)pPtr, iVarLen);
   }
   *pPos = (BYTE)iVarLen;
   pPos++;
   memmove(pPos, pVal, iVarLen);
   return pPos + iVarLen;
}

// String 8
pBYTE FLDCVar8::FldGet(pBYTE pStr, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      if (pPos)
      {
         pDsXml->ReadStr((pCHAR)pPos, (pCHAR)pStr, piLen, NULL);
      }
      return NULL;
   }

   UINT32 iVarLen = (UINT32)(*pPos);

