bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
   pPos++;
   if (pStr)
      memmove(pStr, pPos, iVarLen);
   if (piLen)
      *piLen = iVarLen;
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iVarLen;
}

FLDCVar16::FLDCVar16()
{
}

FLDCVar16::~FLDCVar16()
{
}

FLDCVar16::FLDCVar16(BOOL bConvert)
{
   iLen = sizeof(UINT16);
   this->bConvert = bConvert;
}

pBYTE FLDCVar16::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iVarLen)
{
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromSTRING(pVal, &iVarLen); // Creates a new encoded string of length iVarLen
      return pDsXml->WriteValueLen(pPos, pNamePtr, pXmlType, (pCHAR)pPtr, iVarLen);
   }
   if (!bConvert)
      *(pUINT16)pPos = (UINT16)iVarLen;
   pPos += sizeof(UINT16);
   memmove(pPos, pVal, iVarLen);
   return pPos + iVarLen;
}

// String 16
pBYTE FLDCVar16::FldGet(pBYTE pStr, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      if (pPos)
      {
         pDsXml->ReadStr((pCHAR)pPos, (pCHAR)pStr, piLen, NULL);
      }
      return NULL;
   }

   UINT16 iVarLen;

   if (!bConvert)
      iVarLen = *(pUINT16)pPos;
   pPos += sizeof(UINT16);
   if (pStr)
      memmove(pStr, pPos, (UINT32)iVarLen);
   if (piLen)
      *piLen = (UINT32)iVarLen;
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + (UINT32)iVarLen;
}

FLDUnicode::FLDUnicode()
{
}

FLDUnicode::~FLDUnicode()
{
}

FLDUnicode::FLDUnicode(UINT32 iSize)
{
   iLen = iSize; // prefix size : 1:2:4
   this->bConvert = FALSE;
}

// XmlOnly
pBYTE FLDUnicode::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iVarLen)
{
   pCHAR pPtr = pDsXml->FromUNICODE(pVal, &iVarLen); // Creates a new encoded string of length iVarLen
   return pDsXml->WriteValueLen(pPos, pNamePtr, pXmlType, (pCHAR)pPtr, iVarLen);
}

// Xml only
pBYTE FLDUnicode::FldGet(pBYTE pStr, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   UNREFERENCED_PARAMETER(pbBlank);
   if (pPos)
   {
      pDsXml->ReadUniStr((pCHAR)pPos, (pCHAR)pStr, piLen, NULL);
   }
   return NULL;
}

FLDBinary::FLDBinary()
{
}

FLDBinary::~FLDBinary()
{
}

FLDBinary::FLDBinary(UINT32 iSize)
{
   iLen = iSize; // prefix size : 1:2:4
   this->bConvert = FALSE;
}

// XmlOnly
pBYTE FLDBinary::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iVarLen)
{
   pCHAR pPtr = pDsXml->FromBINARY(pVal, &iVarLen); // Creates a new encoded string of length iVarLen
   return pDsXml->WriteValueLen(pPos, pNamePtr, pXmlType, (pCHAR)pPtr, iVarLen);
}

// Xml only
pBYTE FLDBinary::FldGet(pBYTE pStr, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pPos)
   {
      pDsXml->ReadBinaryStr((pCHAR)pPos, (pCHAR)pStr, piLen, NULL);
   }
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return NULL;
}

FLDAlwaysNull::FLDAlwaysNull()
{
}

FLDAlwaysNull::FLDAlwaysNull(BOOL bConvert)
{
   iLen = 0;
   this->bConvert = bConvert;
}

FLDAlwaysNull::~FLDAlwaysNull()
{
}

pBYTE FLDAlwaysNull::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iLen)
{
   UNREFERENCED_PARAMETER(pPos);
   UNREFERENCED_PARAMETER(pVal);
   UNREFERENCED_PARAMETER(iLen);
   return pPos;
}

pBYTE FLDAlwaysNull::FldGet(pBYTE pPos, pBYTE pVal, pUINT32 piLen, pBOOL pbBlank)
{
   UNREFERENCED_PARAMETER(pVal);
   if (piLen)
      *piLen = 0;
   if (pbBlank)
      *pbBlank = TRUE;
   return pPos;
}

FLDCVar32::FLDCVar32()
{
}

FLDCVar32::~FLDCVar32()
{
}

FLDCVar32::FLDCVar32(BOOL bConvert)
{
   iLen = 4;
   this->bConvert = bConvert;
}

pBYTE FLDCVar32::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iVarLen)
{
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromSTRING(pVal, &iVarLen); // Creates a new encoded string of length iVarLen
      return pDsXml->WriteValueLen(pPos, pNamePtr, pXmlType, (pCHAR)pPtr, iVarLen);
   }
   if (!bConvert)
      *(pUINT32)pPos = iVarLen;
   pPos += sizeof(UINT32);
   if (iVarLen & dsDELAYEDBIT) // There is no data in this case !
      return pPos;
   memmove(pPos, pVal, iVarLen);
   return pPos + iVarLen;
}

// String 32
pBYTE FLDCVar32::FldGet(pBYTE pStr, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      if (pPos)
      {
         pDsXml->ReadStr((pCHAR)pPos, (pCHAR)pStr, piLen, NULL);
      }
      return NULL;
   }

   UINT32 iVarLen;

   if (!bConvert)
      iVarLen = *(pUINT32)pPos;
   pPos += sizeof(UINT32);
   if (piLen)
      *piLen = iVarLen;
   if (iVarLen & dsDELAYEDBIT) // No data in this case
      iVarLen = 0;
   if (pStr && iVarLen)
   {
      memmove(pStr, pPos, iVarLen);
   }
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iVarLen;
}

FLDCInt8::FLDCInt8()
{
}

FLDCInt8::~FLDCInt8()
{
}

FLDCInt8::FLDCInt8(BOOL bConvert, BOOL bSigned)
{
   iLen = 1;
   this->bConvert = bConvert;
   this->bSigned = bSigned;
   pXmlType = bSigned ? (char*)szXMLInt8 : (char*)szXMLUInt8;
}

pBYTE FLDCInt8::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromINT8(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   *pPos = *pVal;
   return pPos + iLen;
}

// Int8
pBYTE FLDCInt8::FldGet(pBYTE pInt, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      INT32 iInt = 0;

      if (pPos)
      {
         pDsXml->ReadINT32((pCHAR)pPos, &iInt, *piLen, pbBlank);
      }
      if (pInt)
         *pInt = (BYTE)iInt;
      if (piLen)
         *piLen = iLen;

      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pInt)
   {
      *pInt = *pPos;
   }
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos+sizeof(BYTE);
}

FLDCInt16::FLDCInt16()
{
   pXmlType = bSigned ? (char*)szXMLInt16 : (char*)szXMLUInt16;
}

FLDCInt16::~FLDCInt16()
{
}

FLDCInt16::FLDCInt16(BOOL bConvert, BOOL bSigned)
{
   iLen = sizeof(UINT16);
   this->bConvert = bConvert;
   this->bSigned = bSigned;
}

pBYTE FLDCInt16::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromINT16(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }

   if (!bConvert)
      *(pUINT16)pPos = *(pUINT16)pVal;
   return pPos+sizeof(UINT16);
}

// Int16
pBYTE FLDCInt16::FldGet(pBYTE pInt, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      INT32 iInt = 0;

      if (pPos)
      {
         pDsXml->ReadINT32((pCHAR)pPos, &iInt, *piLen, pbBlank);
      }
      if (pInt)
         *(pUINT16)pInt = (UINT16)iInt;
      if (piLen)
         *piLen = iLen;
      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pInt)
   {
      if (!bConvert)
         *(pUINT16)pInt = *(pUINT16)pPos;
   }
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos+sizeof(UINT16);
}

