bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
FLDCInt32::FLDCInt32()
{
}

FLDCInt32::~FLDCInt32()
{
}

// NOTE, if XML, we also need to do the convert
FLDCInt32::FLDCInt32(BOOL bConvert, BOOL bSigned)
{
   iLen = 4;
   this->bConvert = bConvert;
   this->bSigned = bSigned;
   pXmlType = bSigned ? ((char*)szXMLInt32) : ((char*)szXMLUInt32);
}

pBYTE FLDCInt32::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromINT32(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   if (!bConvert)
      *(pUINT)pPos = *(pUINT)pVal;
   return pPos+sizeof(UINT);
}

// Int32
pBYTE FLDCInt32::FldGet(pBYTE pInt, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      INT32 iInt = 0;

      if (pPos)
      {
         pDsXml->ReadINT32((pCHAR)pPos, &iInt, *piLen, pbBlank);
      }
      if (pInt)
         *(pUINT)pInt = iInt;
      if (piLen)
         *piLen = iLen;
      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pInt)
   {
      if (!bConvert)
         *(pUINT)pInt = *(pUINT)pPos;
   }
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos+sizeof(UINT);
}

FLDCBool::FLDCBool()
{
   pFldObj = NULL;
}

FLDCBool::~FLDCBool()
{
   if (pFldObj)
      delete pFldObj;
}

FLDCBool::FLDCBool(BOOL bConvert, UINT32 iSize)
{
   iLen = iSize;
   this->bConvert = bConvert;
   pFldObj = (iSize == 4) ? (FLDConv*)new FLDCInt32(bConvert, FALSE) : (iSize == 2) ? (FLDConv*)new FLDCInt16
      (bConvert, FALSE) : (iSize == 1) ? (FLDConv*)new FLDCInt8(bConvert, FALSE) : NULL;
   pXmlType = szXMLBool;

}

pBYTE FLDCBool::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   if (pDsXml)
   {
      pCCHAR pPtr = (iLen == 1) ? pDsXml->FromBOOL8(pVal) : (iLen == 2) ? pDsXml->FromBOOL16(pVal) : pDsXml->FromBOOL32
         (pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }

   bool boolVal = *pVal;
   return pFldObj->FldPut(pPos, (pBYTE)&boolVal, iIgnLen);
}

// Bool
pBYTE FLDCBool::FldGet(pBYTE pBool, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      BOOL bBool;

      if (pPos)
      {
         pDsXml->ReadBOOL((pCHAR)pPos, &bBool, *piLen, pbBlank);
      }
      if (pBool)
      {
         if (iLen == 1)
            *pBool = (bool)(INT8)bBool;
         else if (iLen == 2)
            *(pINT16)pBool = (bool)(INT16)bBool;
         else
            *(pINT32)pBool = (bool)(INT32)bBool;
      }
      if (piLen)
         *piLen = iLen;

      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   return pFldObj->FldGet(pBool, pPos, piLen, pbBlank);
}

FLDCDATE::FLDCDATE()
{

}

FLDCDATE::~FLDCDATE()
{
}

FLDCDATE::FLDCDATE(BOOL bConvert)
{
   iLen = 4;
   this->bConvert = bConvert;
   pXmlType = szXMLDate;
}

pBYTE FLDCDATE::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {

      pCHAR pPtr = pDsXml->FromDATE(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   return NULL;
}

// Date
pBYTE FLDCDATE::FldGet(pBYTE pDate, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      UINT32 iDate;

      if (pPos)
      {
         pDsXml->ReadDATE((pCHAR)pPos, &iDate, *piLen, pbBlank);
      }
      if (pDate)
         *(pUINT32)pDate = iDate;
      if (piLen)
         *piLen = iLen;
      return NULL;
   }
   if (piLen)
      *piLen = iLen;
   return NULL;
}

FLDCTIME::FLDCTIME()
{

}

FLDCTIME::~FLDCTIME()
{
}

FLDCTIME::FLDCTIME(BOOL bConvert)
{
   iLen = 4;
   this->bConvert = bConvert;
   pXmlType = szXMLTime;
}

pBYTE FLDCTIME::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromTIME(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   return NULL;
}

// Time
pBYTE FLDCTIME::FldGet(pBYTE pTime, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      UINT32 iTime;

      if (pPos)
      {
         pDsXml->ReadTIME((pCHAR)pPos, &iTime, *piLen, pbBlank);
      }
      if (pTime)
         *(pUINT32)pTime = iTime;
      if (piLen)
         *piLen = iLen;
      return NULL;
   }
   return NULL;
}

FLDCTIMESTAMP::FLDCTIMESTAMP()
{
   pFldObjDate = NULL;
   pFldObjTime = NULL;
}

FLDCTIMESTAMP::~FLDCTIMESTAMP()
{
   if (pFldObjDate)
      delete pFldObjDate;
   if (pFldObjTime)
      delete pFldObjTime;
}

FLDCTIMESTAMP::FLDCTIMESTAMP(BOOL bConvert)
{
   iLen = 8;
   this->bConvert = bConvert;
   pFldObjDate = new FLDCDATE(bConvert);
   pFldObjTime = new FLDCTIME(bConvert);
}

pBYTE FLDCTIMESTAMP::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromTIMESTAMP(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   return NULL;
}

// TimeStamp
pBYTE FLDCTIMESTAMP::FldGet(pBYTE piTimeStamp, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      DFLOAT iTimeStamp;

      if (pPos)
      {
         pDsXml->ReadTIMESTAMP((pCHAR)pPos, &iTimeStamp, *piLen, pbBlank);
      }
      if (piTimeStamp)
         *(pDFLOAT)piTimeStamp = iTimeStamp;
      if (piLen)
         *piLen = iLen;
      return NULL;
   }
   return NULL;
}

FLDCSQLTIMESTAMP::FLDCSQLTIMESTAMP()
{
   iLen = sizeof(SQLTIMESTAMP);
   this->bConvert = FALSE;
}

FLDCSQLTIMESTAMP::~FLDCSQLTIMESTAMP()
{
}

FLDCSQLTIMESTAMP::FLDCSQLTIMESTAMP(BOOL bConvert)
{
   iLen = sizeof(SQLTIMESTAMP);
   this->bConvert = bConvert;
}

pBYTE FLDCSQLTIMESTAMP::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromSQLTIMESTAMP(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   memcpy(pPos, pVal, iLen);
   return pPos + iLen;
}

// TimeStamp
pBYTE FLDCSQLTIMESTAMP::FldGet(pBYTE pTimeStamp, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      SQLTIMESTAMP iSQLTimeStamp;
      if (pPos)
      {
         pDsXml->ReadSQLTIMESTAMP((pCHAR)pPos, &iSQLTimeStamp, *piLen, pbBlank);
      }
      if (pTimeStamp)
         *((SQLTIMESTAMP*)pTimeStamp) = iSQLTimeStamp;
      return NULL;
   }
   if (piLen)
      *piLen = iLen;
   if (pTimeStamp)
      *(SQLTIMESTAMP*)pTimeStamp = *(SQLTIMESTAMP*)pPos;
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

FLDCSQLTIMESTAMPOFFSET::FLDCSQLTIMESTAMPOFFSET()
{
   iLen = sizeof(SQLTIMESTAMPOFFSET);
   this->bConvert = FALSE;
}

