bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
FLDCSQLTIMESTAMPOFFSET::~FLDCSQLTIMESTAMPOFFSET()
{
}

FLDCSQLTIMESTAMPOFFSET::FLDCSQLTIMESTAMPOFFSET(BOOL bConvert)
{
   iLen = sizeof(SQLTIMESTAMPOFFSET);
   this->bConvert = bConvert;
}

pBYTE FLDCSQLTIMESTAMPOFFSET::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromSQLTIMESTAMPOFFSET(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   memcpy(pPos, pVal, iLen);
   return pPos + iLen;
}

// TimeStamp
pBYTE FLDCSQLTIMESTAMPOFFSET::FldGet(pBYTE pTimeStampOffset, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      SQLTIMESTAMPOFFSET iSQLTimeStampOffset;

      if (pPos)
      {
         pDsXml->ReadSQLTIMESTAMPOFFSET((pCHAR)pPos, &iSQLTimeStampOffset, *piLen, pbBlank);
      }
      if (pTimeStampOffset)
         *(SQLTIMESTAMPOFFSET*)pTimeStampOffset = iSQLTimeStampOffset;
      return NULL;
   }
   if (piLen)
      *piLen = iLen;
   if (pTimeStampOffset)
      *(SQLTIMESTAMPOFFSET*)pTimeStampOffset = *(SQLTIMESTAMPOFFSET*)pPos;
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

FLDCInt64::FLDCInt64()
{
}

FLDCInt64::~FLDCInt64()
{
}

FLDCInt64::FLDCInt64(BOOL bConvert, BOOL bSigned)
{
   iLen = 8;
   this->bConvert = bConvert;
   this->bSigned = bSigned;
   pXmlType = bSigned ? (char*)szXMLInt64 : (char*)szXMLUInt64;
}

pBYTE FLDCInt64::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromINT64(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   if (!bConvert)
      memcpy(pPos, pVal, sizeof(UINT64));
   return pPos + sizeof(UINT64);
}

pBYTE FLDCInt64::FldGet(pBYTE pVal, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      INT64 iInt = 0;

      if (pPos)
         pDsXml->ReadINT64((pCHAR)pPos, &iInt, *piLen, pbBlank);
      if (pVal)
         *(pINT64)pVal = iInt;
      if (piLen)
         *piLen = iLen;
      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pVal)
   {
      if (!bConvert)
        memcpy(pVal, pPos, sizeof(UINT64));
   }
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos+sizeof(UINT64);
}

FLDCSingle::FLDCSingle()
{
}

FLDCSingle::~FLDCSingle()
{
}

FLDCSingle::FLDCSingle(BOOL bConvert)
{
   iLen = 8;
   this->bConvert = bConvert;
   pXmlType = szXMLSingle;
}

pBYTE FLDCSingle::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromSINGLE(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   memmove(pPos, pVal, iLen);
   return pPos + iLen;
}

// Float/Double 8
pBYTE FLDCSingle::FldGet(pBYTE pSingle, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      SINGLE iSingle;

      if (pPos)
      {
         pDsXml->ReadSINGLE((pCHAR)pPos, &iSingle, *piLen, pbBlank);
      }
      if (pSingle)
         *(pSINGLE)pSingle = iSingle;
      if (piLen)
         *piLen = iLen;

      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pSingle)
      memmove(pSingle, pPos, iLen);
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

FLDCFloat::FLDCFloat()
{
}

FLDCFloat::~FLDCFloat()
{
}

FLDCFloat::FLDCFloat(BOOL bConvert)
{
   iLen = 8;
   this->bConvert = bConvert;
   pXmlType = szXMLFloat;
}

pBYTE FLDCFloat::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromFLOAT(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   memmove(pPos, pVal, iLen);
   return pPos + iLen;
}

// Float/Double 8
pBYTE FLDCFloat::FldGet(pBYTE pDFloat, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      DFLOAT iFloat;

      if (pPos)
      {
         pDsXml->ReadFLOAT((pCHAR)pPos, &iFloat, *piLen, pbBlank);
      }
      if (pDFloat)
         *(pDFLOAT)pDFloat = iFloat;
      if (piLen)
         *piLen = iLen;

      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pDFloat)
      memmove(pDFloat, pPos, iLen);
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

FLDCFloatIEEE::FLDCFloatIEEE()
{
}

FLDCFloatIEEE::~FLDCFloatIEEE()
{
}

FLDCFloatIEEE::FLDCFloatIEEE(BOOL bConvert)
{
   iLen = 10;
   this->bConvert = bConvert;
   pXmlType = szXMLNumber;
}

pBYTE FLDCFloatIEEE::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromFLOATIEEE(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   memmove(pPos, pVal, iLen);
   return pPos + iLen;
}

// Float/Double  10
pBYTE FLDCFloatIEEE::FldGet(pBYTE pVal, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pVal)
      memmove(pVal, pPos, iLen);
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

FLDCBcd::FLDCBcd()
{
}

FLDCBcd::~FLDCBcd()
{
}

FLDCBcd::FLDCBcd(BOOL bConvert, UINT32 iPrecision, UINT32 iDecimals)
{
   iLen = 18; // iPrecision+2 must be <= 18
   this->bConvert = bConvert;
   pXmlType = szXMLFixed; // Set decimals etc
   this->iPrecision = iPrecision;
   this->iDecimals = iDecimals;
}

pBYTE FLDCBcd::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iLen)
{
   if (pDsXml)
   {
      pCHAR pPtr = pDsXml->FromBCD(pVal);
      return pDsXml->WriteValue(pPos, pNamePtr, pXmlType, pPtr);
   }
   memmove(pPos, pVal, iLen);
   return pPos + iLen;
}

// Bcd/fixed
pBYTE FLDCBcd::FldGet(pBYTE pVal, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
      pDsXml->ReadBCD((pCHAR)pPos, pVal, *piLen, pbBlank, iPrecision, iDecimals); // Double
      if (piLen)
         *piLen = iLen;
      return NULL;
   }

   if (piLen)
      *piLen = iLen;
   if (pVal)
      memmove(pVal, pPos, iLen);
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

