bergsteiger/realwork/common/components/rtl/external/Embarcadero/DelphiBerlin/data/dsnap/midas/dspickle.cpp
FLDCFixed::FLDCFixed()
{
}

FLDCFixed::~FLDCFixed()
{
}

FLDCFixed::FLDCFixed(BOOL bConvert, UINT32 iFixedLen)
{
   iLen = iFixedLen;
   this->bConvert = bConvert;
}

pBYTE FLDCFixed::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UNREFERENCED_PARAMETER(iIgnLen);

   if (pDsXml)
   {
      return pDsXml->WriteValueLen(pPos, pNamePtr, pXmlType, (pCHAR)pVal, iLen);
   }
   memmove(pPos, pVal, iLen); // Use internal length
   return pPos + iLen;
}

// FixedChar ?
pBYTE FLDCFixed::FldGet(pBYTE pVal, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   if (pDsXml)
   {
   }

   if (piLen)
      *piLen = iLen;
   if (pVal)
      memmove(pVal, pPos, iLen);
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos + iLen;
}

FLDCRepeat::FLDCRepeat()
{
}

FLDCRepeat::~FLDCRepeat()
{
   if (pFldElement)
      delete pFldElement;
   if (pFldObjCount)
      delete pFldObjCount;
}

FLDCRepeat::FLDCRepeat(BOOL bConvert, FLDConv *pFldObj)
{
   iLen = 4;
   this->bConvert = bConvert;
   pFldObjCount = new FLDCInt32(bConvert, FALSE);
   pFldElement = pFldObj;
}

// repeat-count is included in pVal
pBYTE FLDCRepeat::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   UINT32 i, iLen = pFldElement->iLen;
   UINT32 iRepeatCount = *(pUINT)pVal;

   UNREFERENCED_PARAMETER(iIgnLen);
   if (pDsXml)
   {
      // Do not write out the count! pPos = pFldObjCount->FldPut(pPos, pVal, pFldObjCount->iLen);
      pVal += sizeof(UINT); // pFldObjCount->iLen;
      for (i = 0; i < iRepeatCount; i++)
      {
         pPos = pFldElement->FldPut(pPos, pVal, iLen);
         pVal += iLen;
         if (i+1 < iRepeatCount)
            pPos = pDsXml->WriteString(pPos, " ", FALSE); // Separate with spaces
      }
      return pPos;
   }

   pPos = pFldObjCount->FldPut(pPos, pVal, sizeof(UINT));
   pVal += sizeof(UINT);

   for (i = 0; i < iRepeatCount; i++)
   {
      pPos = pFldElement->FldPut(pPos, pVal, iLen);
      pVal += iLen;
   }
   return pPos;
}

pBYTE FLDCRepeat::FldGet(pBYTE pVal, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   UINT32 i, iLen = pFldElement->iLen;
   UINT32 iRepeatCount;

   if (pDsXml)
   {
      pUINT32 pRepeatCount = (pUINT32)pVal;
      // DBIResult rslt = DBIERR_NONE;

      // On input pPos and piLen must be set
      pCHAR pValueStart = (pCHAR)pPos;
      pCHAR pValueEnd = (pCHAR)pPos + *piLen;

      iRepeatCount = 0;
      if (pVal)
         pVal += sizeof(UINT32);
      while (pValueStart < pValueEnd)
      {
         while (*pValueStart == ' ')
            pValueStart++;

         if (pVal)
         {
            *(pUINT32)pVal = (UINT32)atoi(pValueStart); // Assumes INT32
            pVal += iLen;
         }
         iRepeatCount++;
         while (*pValueStart != ' ' && *pValueStart != '<' && pValueStart < pValueEnd)
            pValueStart++;
      }
      if (pVal)
         *pRepeatCount = iRepeatCount;
      if (piLen)
         *piLen = sizeof(UINT32)*(1+iRepeatCount);
      return NULL;
   }

   pPos = pFldObjCount->FldGet((pBYTE) &iRepeatCount, pPos, NULL, NULL);
   if (piLen)
      *piLen = iLen*iRepeatCount+sizeof(UINT32);
   if (pVal)
   {
      *(pUINT32)pVal = iRepeatCount;
      pVal += sizeof(UINT32);
      for (i = 0; i < iRepeatCount; i++)
      {
         pPos = pFldElement->FldGet(pVal, pPos, NULL, NULL);
         pVal += iLen;
      }
   }
   else
      pPos += iLen*iRepeatCount;
   if (pbBlank)
      *pbBlank = FALSE; // Not possible
   return pPos;
}

FLDNested::FLDNested()
{
}

FLDNested::FLDNested(BOOL bConvert)
{
   iLen = 0;
   this->bConvert = bConvert;
   pXmlType = szXMLNested;
}

FLDNested::~FLDNested()
{
}

pBYTE FLDNested::FldPut(pBYTE pPos, pBYTE pVal, UINT32 iIgnLen)
{
   if (pDsXml)
   { // Only works if pVal==NULL;
      return pDsXml->WriteEmptyTag(pPos, pNamePtr, TRUE, TRUE);
   }
   UNREFERENCED_PARAMETER(iIgnLen);
   UNREFERENCED_PARAMETER(pVal);
   UNREFERENCED_PARAMETER(pPos);

   return pPos;
}

pBYTE FLDNested::FldGet(pBYTE pVal, pBYTE pPos, pUINT32 piLen, pBOOL pbBlank)
{
   UNREFERENCED_PARAMETER(pPos);
   if (pDsXml)
   {
      DBIResult rslt = DBIERR_NONE;
      XMLTag Tag;

      rslt = pDsXml->pXmlParse->NextTag(&Tag);
      if (!rslt)
      {
         if (Tag.iTagType == Tag_Leaf || Tag.iTagType == Tag_Empty)
         { // No rows
            // Read attribute to see if rows are delayed!
            if (pbBlank)
               *pbBlank = BLANK_NULL;
            if (pVal)
               *(pUINT32)pVal = 0;
         }
         else
         {
            if (pbBlank)
               *pbBlank = FALSE;
            if (pVal)
               *(pUINT32)pVal = (dsDELAYEDBIT -1); // (maximum number, since we don't know how many
         }
         if (piLen)
            *piLen = sizeof(UINT32);
      }
   }
   return NULL;
}

#ifdef DEBUG

DBIResult makeError(UINT32 e)
{
   switch(e)
   {
   case DBIERR_EOF:
      break;
   case DBIERR_DATAPACKETMISMATCH:
      break;
   default:
      break;
   }
   return e;
}
#endif
